{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "import json\n",
    "import math\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt\n",
    "from scipy import stats\n",
    "from py2neo import Graph, Node, Relationship\n",
    "%matplotlib inline\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_to_df(query, graph):\n",
    "    print(\"Starting query...\", end=\" \")\n",
    "    query_start_time = time.time()\n",
    "    df = graph.run(query).to_data_frame()\n",
    "    print(\"Done ({:.2f} minutes).\".format((time.time()-query_start_time)/60))\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to graph database with 278,432,359 nodes and 1,844,501,832 relationships!\n"
     ]
    }
   ],
   "source": [
    "graph = Graph( \"bolt://matlaber10.media.mit.edu:7687\", auth=('neo4j','myneo'))\n",
    "print(\"Connected to graph database with {:,} nodes and {:,} relationships!\".format(\n",
    "    graph.database.primitive_counts['NumberOfNodeIdsInUse'], \n",
    "    graph.database.primitive_counts['NumberOfRelationshipIdsInUse']))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Community focus"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (11.96 minutes).\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"call apoc.export.csv.query(\"\n",
    "\n",
    "// denominator\n",
    "\n",
    "MATCH (u:NatureAuthor)\n",
    "\n",
    "MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "\n",
    "WITH e.strength AS weight, u, COUNT(b) AS k_u\n",
    "\n",
    "WITH u, toFloat(sum(weight*k_u))/sum(k_u) AS den\n",
    "\n",
    "\n",
    "\n",
    "// intracommunity focus\n",
    "\n",
    "OPTIONAL MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "\n",
    "WHERE last(b.louvain) = last(u.louvain)\n",
    "\n",
    "WITH den, u, COUNT(b) AS k_intra_u, CASE WHEN e IS NULL THEN 0 ELSE e.strength END AS weight\n",
    "\n",
    "WITH den, u, CASE WHEN sum(k_intra_u)=0 THEN 0 ELSE toFloat(sum(weight*k_intra_u))/sum(k_intra_u) END AS num\n",
    "\n",
    "WITH den, u, CASE WHEN den=0 THEN 0 ELSE num/den END AS NatureIntraCommunityFocus\n",
    "\n",
    "WITH den, u, NatureIntraCommunityFocus\n",
    "\n",
    "\n",
    "\n",
    "// intercommunity focus\n",
    "\n",
    "OPTIONAL MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "\n",
    "WHERE last(b.louvain) <> last(u.louvain)\n",
    "\n",
    "WITH den, u, NatureIntraCommunityFocus, COUNT(b) AS k_inter_u, CASE WHEN e IS NULL THEN 0 ELSE e.strength END AS weight\n",
    "\n",
    "WITH den, u, NatureIntraCommunityFocus, CASE WHEN sum(k_inter_u)=0 THEN 0 ELSE toFloat(sum(weight*k_inter_u))/sum(k_inter_u) END AS num\n",
    "\n",
    "WITH u, NatureIntraCommunityFocus, CASE WHEN den=0 THEN 0 ELSE num/den END AS NatureInterCommunityFocus\n",
    "\n",
    "\n",
    "\n",
    "RETURN u.name, NatureIntraCommunityFocus, NatureInterCommunityFocus\n",
    "\n",
    "\",\"/import/result/author_focus.csv\",{})\"\"\"\n",
    "\n",
    "df_community_focus = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Professor connections"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... "
     ]
    }
   ],
   "source": [
    "#Augment nodes with pct_last_author\n",
    "query = \"\"\"call apoc.periodic.iterate(\n",
    "\"MATCH (a:Top42Author) RETURN a\",\n",
    "\"MATCH (a)-[r:AUTHORED]->(:Quanta)\n",
    "WITH a, toFloat(SUM(CASE WHEN r.is_last_author THEN 1 ELSE 0 END))/COUNT(r) as pct_last_author\n",
    "SET a.pct_last_author = pct_last_author\", {batchSize:100, parallel:true})\n",
    "\"\"\"\n",
    "\n",
    "df_last_author = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)-[:AUTHORED]-(b:NatureAuthor)\n",
    "    WHERE b.pct_last_author > .5\n",
    "    WITH a, num_pubs, COUNT(distinct q) as num_coauthored_with_prof\n",
    "    RETURN a.name AS name, num_coauthored_with_prof as num_pubs_with_prof, num_pubs, toFloat(num_coauthored_with_prof)/num_pubs AS ratio_pubs_with_prof\n",
    "\"\"\"\n",
    "profs_per_paper = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>num_pubs</th>\n",
       "      <th>num_pubs_with_prof</th>\n",
       "      <th>ratio_pubs_with_prof</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Changlu Liu</td>\n",
       "      <td>103</td>\n",
       "      <td>14</td>\n",
       "      <td>0.135922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Claire M. Wagner</td>\n",
       "      <td>37</td>\n",
       "      <td>1</td>\n",
       "      <td>0.027027</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Robin M. Murray</td>\n",
       "      <td>607</td>\n",
       "      <td>39</td>\n",
       "      <td>0.064250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Sarah Nichol</td>\n",
       "      <td>7</td>\n",
       "      <td>3</td>\n",
       "      <td>0.428571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Francois Roddier</td>\n",
       "      <td>262</td>\n",
       "      <td>19</td>\n",
       "      <td>0.072519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>K. Egberts</td>\n",
       "      <td>198</td>\n",
       "      <td>151</td>\n",
       "      <td>0.762626</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Rupa Sridharan</td>\n",
       "      <td>22</td>\n",
       "      <td>3</td>\n",
       "      <td>0.136364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>L. Bernstein</td>\n",
       "      <td>115</td>\n",
       "      <td>18</td>\n",
       "      <td>0.156522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Patrick K. Kimes</td>\n",
       "      <td>8</td>\n",
       "      <td>7</td>\n",
       "      <td>0.875000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Corey B. Puryear</td>\n",
       "      <td>16</td>\n",
       "      <td>2</td>\n",
       "      <td>0.125000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Clelia Rossi-Arnaud</td>\n",
       "      <td>67</td>\n",
       "      <td>3</td>\n",
       "      <td>0.044776</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Robin G. Bombardi</td>\n",
       "      <td>3</td>\n",
       "      <td>2</td>\n",
       "      <td>0.666667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Don Kirkham</td>\n",
       "      <td>177</td>\n",
       "      <td>20</td>\n",
       "      <td>0.112994</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Lolita Lorenzon</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Joost M. Woltering</td>\n",
       "      <td>25</td>\n",
       "      <td>20</td>\n",
       "      <td>0.800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Leonora S. Galante</td>\n",
       "      <td>11</td>\n",
       "      <td>9</td>\n",
       "      <td>0.818182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>David A. Rasko</td>\n",
       "      <td>160</td>\n",
       "      <td>61</td>\n",
       "      <td>0.381250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Douglas Macewan</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>J. M. Rosamilia</td>\n",
       "      <td>74</td>\n",
       "      <td>10</td>\n",
       "      <td>0.135135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Guba F</td>\n",
       "      <td>65</td>\n",
       "      <td>2</td>\n",
       "      <td>0.030769</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>M. R. Aswathanarayana Rao</td>\n",
       "      <td>4</td>\n",
       "      <td>2</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Florian Haupt</td>\n",
       "      <td>43</td>\n",
       "      <td>11</td>\n",
       "      <td>0.255814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Richard F. Mushotzky</td>\n",
       "      <td>537</td>\n",
       "      <td>32</td>\n",
       "      <td>0.059590</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>C. H. Klang</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Edward D. Parker</td>\n",
       "      <td>9</td>\n",
       "      <td>3</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Giulia Siravegna</td>\n",
       "      <td>44</td>\n",
       "      <td>1</td>\n",
       "      <td>0.022727</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>William N. Ross</td>\n",
       "      <td>75</td>\n",
       "      <td>18</td>\n",
       "      <td>0.240000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Donald J. Cummings</td>\n",
       "      <td>120</td>\n",
       "      <td>5</td>\n",
       "      <td>0.041667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>S. P. Monk</td>\n",
       "      <td>9</td>\n",
       "      <td>1</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>R. Simpson</td>\n",
       "      <td>255</td>\n",
       "      <td>5</td>\n",
       "      <td>0.019608</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256032</th>\n",
       "      <td>Neal R. Butler</td>\n",
       "      <td>72</td>\n",
       "      <td>1</td>\n",
       "      <td>0.013889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256033</th>\n",
       "      <td>Steven M. Barnard</td>\n",
       "      <td>36</td>\n",
       "      <td>16</td>\n",
       "      <td>0.444444</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256034</th>\n",
       "      <td>Hermann Ragg</td>\n",
       "      <td>62</td>\n",
       "      <td>15</td>\n",
       "      <td>0.241935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256035</th>\n",
       "      <td>E. Jimenez</td>\n",
       "      <td>116</td>\n",
       "      <td>2</td>\n",
       "      <td>0.017241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256036</th>\n",
       "      <td>I. Fisk</td>\n",
       "      <td>967</td>\n",
       "      <td>822</td>\n",
       "      <td>0.850052</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256037</th>\n",
       "      <td>Ary A. Hoffmann</td>\n",
       "      <td>573</td>\n",
       "      <td>84</td>\n",
       "      <td>0.146597</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256038</th>\n",
       "      <td>Laurie A. Christianson</td>\n",
       "      <td>17</td>\n",
       "      <td>14</td>\n",
       "      <td>0.823529</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256039</th>\n",
       "      <td>Jonas Emsley</td>\n",
       "      <td>74</td>\n",
       "      <td>15</td>\n",
       "      <td>0.202703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256040</th>\n",
       "      <td>Namsoo Shin</td>\n",
       "      <td>82</td>\n",
       "      <td>2</td>\n",
       "      <td>0.024390</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256041</th>\n",
       "      <td>Motoo Kano</td>\n",
       "      <td>21</td>\n",
       "      <td>4</td>\n",
       "      <td>0.190476</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256042</th>\n",
       "      <td>C. A. Evans</td>\n",
       "      <td>215</td>\n",
       "      <td>39</td>\n",
       "      <td>0.181395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256043</th>\n",
       "      <td>Sally A. Lorimore</td>\n",
       "      <td>47</td>\n",
       "      <td>46</td>\n",
       "      <td>0.978723</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256044</th>\n",
       "      <td>Emmanuel Heller</td>\n",
       "      <td>6</td>\n",
       "      <td>4</td>\n",
       "      <td>0.666667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256045</th>\n",
       "      <td>V. Kinzel</td>\n",
       "      <td>33</td>\n",
       "      <td>14</td>\n",
       "      <td>0.424242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256046</th>\n",
       "      <td>Ross I. M. Wadsworth</td>\n",
       "      <td>5</td>\n",
       "      <td>4</td>\n",
       "      <td>0.800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256047</th>\n",
       "      <td>Charles P</td>\n",
       "      <td>73</td>\n",
       "      <td>23</td>\n",
       "      <td>0.315068</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256048</th>\n",
       "      <td>William R. Webster</td>\n",
       "      <td>30</td>\n",
       "      <td>2</td>\n",
       "      <td>0.066667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256049</th>\n",
       "      <td>Tiaojiang Xiao</td>\n",
       "      <td>17</td>\n",
       "      <td>8</td>\n",
       "      <td>0.470588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256050</th>\n",
       "      <td>Alan Heavens</td>\n",
       "      <td>243</td>\n",
       "      <td>61</td>\n",
       "      <td>0.251029</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256051</th>\n",
       "      <td>Alexander V. Chervonsky</td>\n",
       "      <td>79</td>\n",
       "      <td>24</td>\n",
       "      <td>0.303797</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256052</th>\n",
       "      <td>Young Soo Joung</td>\n",
       "      <td>23</td>\n",
       "      <td>20</td>\n",
       "      <td>0.869565</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256053</th>\n",
       "      <td>W. Schawaller</td>\n",
       "      <td>22</td>\n",
       "      <td>3</td>\n",
       "      <td>0.136364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256054</th>\n",
       "      <td>Raju T. Dhawan</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256055</th>\n",
       "      <td>Stefan Fält</td>\n",
       "      <td>23</td>\n",
       "      <td>10</td>\n",
       "      <td>0.434783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256056</th>\n",
       "      <td>A. J. Pearman</td>\n",
       "      <td>22</td>\n",
       "      <td>18</td>\n",
       "      <td>0.818182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256057</th>\n",
       "      <td>E. L. Leafe</td>\n",
       "      <td>17</td>\n",
       "      <td>7</td>\n",
       "      <td>0.411765</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256058</th>\n",
       "      <td>D. W. Gillings</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>0.200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256059</th>\n",
       "      <td>Hugh Garavan</td>\n",
       "      <td>284</td>\n",
       "      <td>45</td>\n",
       "      <td>0.158451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256060</th>\n",
       "      <td>D. W. Beran</td>\n",
       "      <td>29</td>\n",
       "      <td>5</td>\n",
       "      <td>0.172414</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>256061</th>\n",
       "      <td>A. A. Krysko</td>\n",
       "      <td>28</td>\n",
       "      <td>13</td>\n",
       "      <td>0.464286</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>256062 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                             name  num_pubs  num_pubs_with_prof  \\\n",
       "0                     Changlu Liu       103                  14   \n",
       "1                Claire M. Wagner        37                   1   \n",
       "2                 Robin M. Murray       607                  39   \n",
       "3                    Sarah Nichol         7                   3   \n",
       "4                Francois Roddier       262                  19   \n",
       "5                      K. Egberts       198                 151   \n",
       "6                  Rupa Sridharan        22                   3   \n",
       "7                    L. Bernstein       115                  18   \n",
       "8                Patrick K. Kimes         8                   7   \n",
       "9                Corey B. Puryear        16                   2   \n",
       "10            Clelia Rossi-Arnaud        67                   3   \n",
       "11              Robin G. Bombardi         3                   2   \n",
       "12                    Don Kirkham       177                  20   \n",
       "13                Lolita Lorenzon         1                   1   \n",
       "14             Joost M. Woltering        25                  20   \n",
       "15             Leonora S. Galante        11                   9   \n",
       "16                 David A. Rasko       160                  61   \n",
       "17                Douglas Macewan         2                   2   \n",
       "18                J. M. Rosamilia        74                  10   \n",
       "19                         Guba F        65                   2   \n",
       "20      M. R. Aswathanarayana Rao         4                   2   \n",
       "21                  Florian Haupt        43                  11   \n",
       "22           Richard F. Mushotzky       537                  32   \n",
       "23                    C. H. Klang         1                   1   \n",
       "24               Edward D. Parker         9                   3   \n",
       "25               Giulia Siravegna        44                   1   \n",
       "26                William N. Ross        75                  18   \n",
       "27             Donald J. Cummings       120                   5   \n",
       "28                     S. P. Monk         9                   1   \n",
       "29                     R. Simpson       255                   5   \n",
       "...                           ...       ...                 ...   \n",
       "256032             Neal R. Butler        72                   1   \n",
       "256033          Steven M. Barnard        36                  16   \n",
       "256034               Hermann Ragg        62                  15   \n",
       "256035                 E. Jimenez       116                   2   \n",
       "256036                    I. Fisk       967                 822   \n",
       "256037            Ary A. Hoffmann       573                  84   \n",
       "256038     Laurie A. Christianson        17                  14   \n",
       "256039               Jonas Emsley        74                  15   \n",
       "256040                Namsoo Shin        82                   2   \n",
       "256041                 Motoo Kano        21                   4   \n",
       "256042                C. A. Evans       215                  39   \n",
       "256043          Sally A. Lorimore        47                  46   \n",
       "256044            Emmanuel Heller         6                   4   \n",
       "256045                  V. Kinzel        33                  14   \n",
       "256046       Ross I. M. Wadsworth         5                   4   \n",
       "256047                  Charles P        73                  23   \n",
       "256048         William R. Webster        30                   2   \n",
       "256049             Tiaojiang Xiao        17                   8   \n",
       "256050               Alan Heavens       243                  61   \n",
       "256051    Alexander V. Chervonsky        79                  24   \n",
       "256052            Young Soo Joung        23                  20   \n",
       "256053              W. Schawaller        22                   3   \n",
       "256054             Raju T. Dhawan         3                   1   \n",
       "256055                Stefan Fält        23                  10   \n",
       "256056              A. J. Pearman        22                  18   \n",
       "256057                E. L. Leafe        17                   7   \n",
       "256058             D. W. Gillings         5                   1   \n",
       "256059               Hugh Garavan       284                  45   \n",
       "256060                D. W. Beran        29                   5   \n",
       "256061               A. A. Krysko        28                  13   \n",
       "\n",
       "        ratio_pubs_with_prof  \n",
       "0                   0.135922  \n",
       "1                   0.027027  \n",
       "2                   0.064250  \n",
       "3                   0.428571  \n",
       "4                   0.072519  \n",
       "5                   0.762626  \n",
       "6                   0.136364  \n",
       "7                   0.156522  \n",
       "8                   0.875000  \n",
       "9                   0.125000  \n",
       "10                  0.044776  \n",
       "11                  0.666667  \n",
       "12                  0.112994  \n",
       "13                  1.000000  \n",
       "14                  0.800000  \n",
       "15                  0.818182  \n",
       "16                  0.381250  \n",
       "17                  1.000000  \n",
       "18                  0.135135  \n",
       "19                  0.030769  \n",
       "20                  0.500000  \n",
       "21                  0.255814  \n",
       "22                  0.059590  \n",
       "23                  1.000000  \n",
       "24                  0.333333  \n",
       "25                  0.022727  \n",
       "26                  0.240000  \n",
       "27                  0.041667  \n",
       "28                  0.111111  \n",
       "29                  0.019608  \n",
       "...                      ...  \n",
       "256032              0.013889  \n",
       "256033              0.444444  \n",
       "256034              0.241935  \n",
       "256035              0.017241  \n",
       "256036              0.850052  \n",
       "256037              0.146597  \n",
       "256038              0.823529  \n",
       "256039              0.202703  \n",
       "256040              0.024390  \n",
       "256041              0.190476  \n",
       "256042              0.181395  \n",
       "256043              0.978723  \n",
       "256044              0.666667  \n",
       "256045              0.424242  \n",
       "256046              0.800000  \n",
       "256047              0.315068  \n",
       "256048              0.066667  \n",
       "256049              0.470588  \n",
       "256050              0.251029  \n",
       "256051              0.303797  \n",
       "256052              0.869565  \n",
       "256053              0.136364  \n",
       "256054              0.333333  \n",
       "256055              0.434783  \n",
       "256056              0.818182  \n",
       "256057              0.411765  \n",
       "256058              0.200000  \n",
       "256059              0.158451  \n",
       "256060              0.172414  \n",
       "256061              0.464286  \n",
       "\n",
       "[256062 rows x 4 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "profs_per_paper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "profs_per_paper.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\paper.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Ratio of prof-prof connected papers\n",
    "#WORKING\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WITH a, COUNT(q) AS num_pubs\n",
    "MATCH (a)-[r:COAUTHOR]-(b:NatureAuthor)\n",
    "WHERE b.pct_last_author > .5\n",
    "WITH a, num_pubs, SUM(r.strength42) as num_coauthored_with_prof\n",
    "RETURN a.name AS name, num_coauthored_with_prof as prof_connections, num_pubs, toFloat(num_coauthored_with_prof)/num_pubs AS coauthor_profs_ratio\"\"\"\n",
    "\n",
    "df_coauthor_profs_ratio = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_coauthor_papers_ratio.sort_values('coauthor_profs_ratio', ascending=False).tail(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_coauthor_profs_ratio.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\coauthor_profs_ratio.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Cross-cluster edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (6.46 minutes).\n"
     ]
    }
   ],
   "source": [
    "#Ratio of cross-cluster and intra-cluster edges to total edges\n",
    "#WORKING\n",
    "query = \"\"\"\n",
    "MATCH (u:NatureAuthor)\n",
    "MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "WITH u, COUNT(b) AS k_u\n",
    "WITH u, k_u AS den\n",
    "\n",
    "// intracommunity edges\n",
    "OPTIONAL MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "WHERE last(b.louvain) = last(u.louvain)\n",
    "WITH den, u, COUNT(b) AS k_intra_u\n",
    "WITH den, u, k_intra_u AS IntraClusterConns, CASE WHEN den=0 THEN 0 ELSE toFloat(k_intra_u)/den END AS IntraClusterRatio\n",
    "WITH den, u, IntraClusterRatio, IntraClusterConns, 1.0 - IntraClusterRatio AS InterClusterRatio\n",
    "\n",
    "RETURN u.name AS name, IntraClusterRatio, InterClusterRatio, den AS TotalConns, IntraClusterConns, den - IntraClusterConns AS InterClusterConns\n",
    "\"\"\"\n",
    "\n",
    "df_clusters = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>InterClusterConns</th>\n",
       "      <th>InterClusterRatio</th>\n",
       "      <th>IntraClusterConns</th>\n",
       "      <th>IntraClusterRatio</th>\n",
       "      <th>TotalConns</th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1</td>\n",
       "      <td>Carlisle Hj</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3</td>\n",
       "      <td>0.750000</td>\n",
       "      <td>1</td>\n",
       "      <td>0.250000</td>\n",
       "      <td>4</td>\n",
       "      <td>Toshikazu Oshiki</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>2</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>2</td>\n",
       "      <td>Muriel M. Lippman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>111</td>\n",
       "      <td>0.874016</td>\n",
       "      <td>16</td>\n",
       "      <td>0.125984</td>\n",
       "      <td>127</td>\n",
       "      <td>Calliope A. Dendrou</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>67</td>\n",
       "      <td>0.455782</td>\n",
       "      <td>80</td>\n",
       "      <td>0.544218</td>\n",
       "      <td>147</td>\n",
       "      <td>F. Ménard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>30</td>\n",
       "      <td>0.222222</td>\n",
       "      <td>105</td>\n",
       "      <td>0.777778</td>\n",
       "      <td>135</td>\n",
       "      <td>David Zhao</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>3</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>3</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>6</td>\n",
       "      <td>B. Latte</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>1</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>3</td>\n",
       "      <td>Paquin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>28</td>\n",
       "      <td>0.094276</td>\n",
       "      <td>269</td>\n",
       "      <td>0.905724</td>\n",
       "      <td>297</td>\n",
       "      <td>Ines Müller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>2</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>2</td>\n",
       "      <td>Michael L. Dean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>4</td>\n",
       "      <td>0.571429</td>\n",
       "      <td>3</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>7</td>\n",
       "      <td>Joseph M. Steim</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>4</td>\n",
       "      <td>0.307692</td>\n",
       "      <td>9</td>\n",
       "      <td>0.692308</td>\n",
       "      <td>13</td>\n",
       "      <td>Edmund G. Myers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>24</td>\n",
       "      <td>0.705882</td>\n",
       "      <td>10</td>\n",
       "      <td>0.294118</td>\n",
       "      <td>34</td>\n",
       "      <td>Tomaž Curk</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>1</td>\n",
       "      <td>0.111111</td>\n",
       "      <td>8</td>\n",
       "      <td>0.888889</td>\n",
       "      <td>9</td>\n",
       "      <td>Yuli V. Nazarov</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>47</td>\n",
       "      <td>0.470000</td>\n",
       "      <td>53</td>\n",
       "      <td>0.530000</td>\n",
       "      <td>100</td>\n",
       "      <td>W. Gieren</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    InterClusterConns  InterClusterRatio  IntraClusterConns  \\\n",
       "0                   0           0.000000                  1   \n",
       "1                   3           0.750000                  1   \n",
       "2                   0           0.000000                  2   \n",
       "3                 111           0.874016                 16   \n",
       "4                  67           0.455782                 80   \n",
       "5                  30           0.222222                105   \n",
       "6                   3           0.500000                  3   \n",
       "7                   2           0.666667                  1   \n",
       "8                  28           0.094276                269   \n",
       "9                   0           0.000000                  2   \n",
       "10                  4           0.571429                  3   \n",
       "11                  4           0.307692                  9   \n",
       "12                 24           0.705882                 10   \n",
       "13                  1           0.111111                  8   \n",
       "14                 47           0.470000                 53   \n",
       "\n",
       "    IntraClusterRatio  TotalConns                 name  \n",
       "0            1.000000           1          Carlisle Hj  \n",
       "1            0.250000           4     Toshikazu Oshiki  \n",
       "2            1.000000           2    Muriel M. Lippman  \n",
       "3            0.125984         127  Calliope A. Dendrou  \n",
       "4            0.544218         147            F. Ménard  \n",
       "5            0.777778         135           David Zhao  \n",
       "6            0.500000           6             B. Latte  \n",
       "7            0.333333           3               Paquin  \n",
       "8            0.905724         297          Ines Müller  \n",
       "9            1.000000           2      Michael L. Dean  \n",
       "10           0.428571           7      Joseph M. Steim  \n",
       "11           0.692308          13      Edmund G. Myers  \n",
       "12           0.294118          34           Tomaž Curk  \n",
       "13           0.888889           9      Yuli V. Nazarov  \n",
       "14           0.530000         100            W. Gieren  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clusters.head(15)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clusters.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\clusters.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Preparing metrics csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clusters = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\clusters.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_papers = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\papers.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_profs = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\profs.csv', index_col = 'name', encoding = 'UTF-8')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_profs_papers = df_profs.join(df_papers[['num_pubs_with_prof', 'ratio_pubs_with_prof']], how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all = df_profs_papers.join(df_clusters, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_author_focus = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\author_focus.csv', index_col = 'name', encoding = 'UTF-8')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all = df_all.join(df_author_focus, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\metrics.csv', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### All metrics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_metrics = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\metrics.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>profs_per_pub</th>\n",
       "      <th>num_pubs</th>\n",
       "      <th>profs</th>\n",
       "      <th>pubs_with_profs</th>\n",
       "      <th>ratio_pubs_with_prof</th>\n",
       "      <th>InterClusterConns</th>\n",
       "      <th>InterClusterRatio</th>\n",
       "      <th>IntraClusterConns</th>\n",
       "      <th>IntraClusterRatio</th>\n",
       "      <th>TotalConns</th>\n",
       "      <th>IntraCommunityFocus</th>\n",
       "      <th>InterCommunityFocus</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Trevor J. Wardill</th>\n",
       "      <td>0.037037</td>\n",
       "      <td>27.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>16.0</td>\n",
       "      <td>0.592593</td>\n",
       "      <td>13.0</td>\n",
       "      <td>0.619048</td>\n",
       "      <td>8.0</td>\n",
       "      <td>0.380952</td>\n",
       "      <td>21.0</td>\n",
       "      <td>0.562500</td>\n",
       "      <td>1.269231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>van J Jeroen Tilborg</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>7.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>8.0</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>8.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Jason O’Brien</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>22.0</td>\n",
       "      <td>0.916667</td>\n",
       "      <td>24.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>David H. Bromwich</th>\n",
       "      <td>0.012780</td>\n",
       "      <td>313.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>26.0</td>\n",
       "      <td>0.083067</td>\n",
       "      <td>47.0</td>\n",
       "      <td>0.286585</td>\n",
       "      <td>117.0</td>\n",
       "      <td>0.713415</td>\n",
       "      <td>164.0</td>\n",
       "      <td>0.883269</td>\n",
       "      <td>1.290586</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Martha Kane Savage</th>\n",
       "      <td>0.055215</td>\n",
       "      <td>163.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>22.0</td>\n",
       "      <td>0.134969</td>\n",
       "      <td>11.0</td>\n",
       "      <td>0.120879</td>\n",
       "      <td>80.0</td>\n",
       "      <td>0.879121</td>\n",
       "      <td>91.0</td>\n",
       "      <td>0.702574</td>\n",
       "      <td>3.163102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Han-Tzong Su</th>\n",
       "      <td>0.016393</td>\n",
       "      <td>61.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>21.0</td>\n",
       "      <td>0.344262</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0.300000</td>\n",
       "      <td>7.0</td>\n",
       "      <td>0.700000</td>\n",
       "      <td>10.0</td>\n",
       "      <td>0.476190</td>\n",
       "      <td>2.222222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Alfred Arnason</th>\n",
       "      <td>0.034483</td>\n",
       "      <td>58.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>0.137931</td>\n",
       "      <td>18.0</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>18.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Robert Walton</th>\n",
       "      <td>0.005780</td>\n",
       "      <td>173.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>13.0</td>\n",
       "      <td>0.075145</td>\n",
       "      <td>20.0</td>\n",
       "      <td>0.869565</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0.130435</td>\n",
       "      <td>23.0</td>\n",
       "      <td>0.239583</td>\n",
       "      <td>1.114062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Catherine M. F. Lohmann</th>\n",
       "      <td>0.214286</td>\n",
       "      <td>28.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>26.0</td>\n",
       "      <td>0.928571</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>4.0</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>4.0</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>S. Bradley Cenko</th>\n",
       "      <td>0.004246</td>\n",
       "      <td>471.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>32.0</td>\n",
       "      <td>0.067941</td>\n",
       "      <td>26.0</td>\n",
       "      <td>0.109705</td>\n",
       "      <td>211.0</td>\n",
       "      <td>0.890295</td>\n",
       "      <td>237.0</td>\n",
       "      <td>1.047124</td>\n",
       "      <td>0.617573</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         profs_per_pub  num_pubs  profs  pubs_with_profs  \\\n",
       "name                                                                       \n",
       "Trevor J. Wardill             0.037037      27.0    1.0             16.0   \n",
       "van J Jeroen Tilborg          0.142857       7.0    1.0              7.0   \n",
       "Jason O’Brien                      NaN       NaN    NaN              NaN   \n",
       "David H. Bromwich             0.012780     313.0    4.0             26.0   \n",
       "Martha Kane Savage            0.055215     163.0    9.0             22.0   \n",
       "Han-Tzong Su                  0.016393      61.0    1.0             21.0   \n",
       "Alfred Arnason                0.034483      58.0    2.0              8.0   \n",
       "Robert Walton                 0.005780     173.0    1.0             13.0   \n",
       "Catherine M. F. Lohmann       0.214286      28.0    6.0             26.0   \n",
       "S. Bradley Cenko              0.004246     471.0    2.0             32.0   \n",
       "\n",
       "                         ratio_pubs_with_prof  InterClusterConns  \\\n",
       "name                                                               \n",
       "Trevor J. Wardill                    0.592593               13.0   \n",
       "van J Jeroen Tilborg                 1.000000                0.0   \n",
       "Jason O’Brien                             NaN                2.0   \n",
       "David H. Bromwich                    0.083067               47.0   \n",
       "Martha Kane Savage                   0.134969               11.0   \n",
       "Han-Tzong Su                         0.344262                3.0   \n",
       "Alfred Arnason                       0.137931               18.0   \n",
       "Robert Walton                        0.075145               20.0   \n",
       "Catherine M. F. Lohmann              0.928571                0.0   \n",
       "S. Bradley Cenko                     0.067941               26.0   \n",
       "\n",
       "                         InterClusterRatio  IntraClusterConns  \\\n",
       "name                                                            \n",
       "Trevor J. Wardill                 0.619048                8.0   \n",
       "van J Jeroen Tilborg              0.000000                8.0   \n",
       "Jason O’Brien                     0.083333               22.0   \n",
       "David H. Bromwich                 0.286585              117.0   \n",
       "Martha Kane Savage                0.120879               80.0   \n",
       "Han-Tzong Su                      0.300000                7.0   \n",
       "Alfred Arnason                    1.000000                0.0   \n",
       "Robert Walton                     0.869565                3.0   \n",
       "Catherine M. F. Lohmann           0.000000                4.0   \n",
       "S. Bradley Cenko                  0.109705              211.0   \n",
       "\n",
       "                         IntraClusterRatio  TotalConns  IntraCommunityFocus  \\\n",
       "name                                                                          \n",
       "Trevor J. Wardill                 0.380952        21.0             0.562500   \n",
       "van J Jeroen Tilborg              1.000000         8.0             0.000000   \n",
       "Jason O’Brien                     0.916667        24.0             0.000000   \n",
       "David H. Bromwich                 0.713415       164.0             0.883269   \n",
       "Martha Kane Savage                0.879121        91.0             0.702574   \n",
       "Han-Tzong Su                      0.700000        10.0             0.476190   \n",
       "Alfred Arnason                    0.000000        18.0             0.000000   \n",
       "Robert Walton                     0.130435        23.0             0.239583   \n",
       "Catherine M. F. Lohmann           1.000000         4.0             1.000000   \n",
       "S. Bradley Cenko                  0.890295       237.0             1.047124   \n",
       "\n",
       "                         InterCommunityFocus  \n",
       "name                                          \n",
       "Trevor J. Wardill                   1.269231  \n",
       "van J Jeroen Tilborg                0.000000  \n",
       "Jason O’Brien                       0.000000  \n",
       "David H. Bromwich                   1.290586  \n",
       "Martha Kane Savage                  3.163102  \n",
       "Han-Tzong Su                        2.222222  \n",
       "Alfred Arnason                      1.000000  \n",
       "Robert Walton                       1.114062  \n",
       "Catherine M. F. Lohmann             0.000000  \n",
       "S. Bradley Cenko                    0.617573  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import random\n",
    "indices = []\n",
    "for i in range(10):\n",
    "    indices.append(random.randrange(0, df_metrics.shape[0]))\n",
    "df_metrics.iloc[indices]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Impact"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#    CALL algo.pageRank(\n",
    "#     'MATCH (p:Quanta {venue:\"Nature\"}) RETURN id(p) as id',\n",
    "#     'MATCH (p1:Quanta {venue:\"Nature\"})-[:CITES]->(p2:Quanta {venue:\"Nature\"}) RETURN id(p1) as source, id(p2) as target',\n",
    "#     {graph:'cypher', iterations:35, write:true, writeProperty:\"npr\"});"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.33 minutes).\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue = 'Nature'\n",
    "WITH a, COUNT(q) AS num_pubs, SUM(q.npr) AS tot_rank, MIN(q.npr) AS min_rank, MAX(q.npr) AS max_rank, percentileCont(q.npr, 0.5) AS median_rank \n",
    "RETURN a.name AS name, num_pubs, toFloat(tot_rank)/num_pubs AS avg_PR, min_rank AS min_PR, max_rank AS max_PR, median_rank AS median_PR\n",
    "\"\"\"\n",
    "\n",
    "df_npr = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>avg_PR</th>\n",
       "      <th>max_PR</th>\n",
       "      <th>median_PR</th>\n",
       "      <th>min_PR</th>\n",
       "      <th>name</th>\n",
       "      <th>num_pubs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.356125</td>\n",
       "      <td>0.356125</td>\n",
       "      <td>0.356125</td>\n",
       "      <td>0.356125</td>\n",
       "      <td>Bruce E. White</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.150000</td>\n",
       "      <td>0.150000</td>\n",
       "      <td>0.150000</td>\n",
       "      <td>0.150000</td>\n",
       "      <td>Pieter W. Kat</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     avg_PR    max_PR  median_PR    min_PR            name  num_pubs\n",
       "0  0.356125  0.356125   0.356125  0.356125  Bruce E. White         1\n",
       "1  0.150000  0.150000   0.150000  0.150000   Pieter W. Kat         1"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_npr.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.38 minutes).\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue = 'Nature'\n",
    "WITH a, COUNT(q) AS num_pubs, SUM(q.nar) AS tot_rank, MIN(q.nar) AS min_rank, MAX(q.nar) AS max_rank, percentileCont(q.nar, 0.5) AS median_rank \n",
    "RETURN a.name AS name, num_pubs, toFloat(tot_rank)/num_pubs AS avg_AR, min_rank AS min_AR, max_rank AS max_AR, median_rank AS median_AR\n",
    "\"\"\"\n",
    "\n",
    "df_nar = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>avg_AR</th>\n",
       "      <th>max_AR</th>\n",
       "      <th>median_AR</th>\n",
       "      <th>min_AR</th>\n",
       "      <th>name</th>\n",
       "      <th>num_pubs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.28266</td>\n",
       "      <td>0.28266</td>\n",
       "      <td>0.28266</td>\n",
       "      <td>0.28266</td>\n",
       "      <td>Bruce E. White</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.15000</td>\n",
       "      <td>0.15000</td>\n",
       "      <td>0.15000</td>\n",
       "      <td>0.15000</td>\n",
       "      <td>Pieter W. Kat</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    avg_AR   max_AR  median_AR   min_AR            name  num_pubs\n",
       "0  0.28266  0.28266    0.28266  0.28266  Bruce E. White         1\n",
       "1  0.15000  0.15000    0.15000  0.15000   Pieter W. Kat         1"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_nar.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_npr.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\npr.csv', index = False, encoding = \"UTF-8\")\n",
    "df_nar.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\nar.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_npr = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\npr.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_nar = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\nar.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_nar = df_nar[[col for col in df_nar.columns if col != 'num_pubs']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_imp = df_npr.join(df_nar, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_imp.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\impact.csv', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
