{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "import time\n",
    "from functools import reduce\n",
    "\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "import warnings\n",
    "warnings.simplefilter(action='ignore', category=FutureWarning)\n",
    "from tqdm.autonotebook import tqdm\n",
    "\n",
    "from py2neo import Graph, Node, Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to graph database with 370,269,897 nodes and 220,155,390 relationships!\n"
     ]
    }
   ],
   "source": [
    "graph = Graph(\"bolt://dev_neo4j:7687\", auth=('neo4j','myneo'))\n",
    "\n",
    "n_nodes = graph.database.primitive_counts['NumberOfNodeIdsInUse']\n",
    "n_relationships = graph.database.primitive_counts['NumberOfRelationshipIdsInUse']\n",
    "print(\"Connected to graph database with {:,} nodes and {:,} relationships!\".format\n",
    "     (n_nodes, n_relationships))\n",
    "\n",
    "def run_query(query, graph, print_query=False, run_query=True, \n",
    "              print_only=False, to_df=False, verbose=True):\n",
    "    df = 1\n",
    "    if print_only: \n",
    "        print_query = True\n",
    "        run_query = False\n",
    "    start_time = time.time()\n",
    "    if print_query:\n",
    "        print(query)\n",
    "    if run_query:\n",
    "        if to_df:\n",
    "            df = graph.run(query).to_data_frame()\n",
    "        else:\n",
    "            graph.run(query)\n",
    "    end_time = time.time()\n",
    "    minutes_elapsed = (end_time-start_time)/60\n",
    "    if verbose:\n",
    "        print(\"Query completed in {:.2f} minutes.\".format(minutes_elapsed))\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "886a3e84df6c410780c12d0c3d3f81ea",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(IntProgress(value=0, max=121), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1900...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1900 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1901...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1901 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1902...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1902 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1903...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1903 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1904...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1904 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1905...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1905 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1906...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1906 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1907...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1907 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1908...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1908 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1909...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1909 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1910...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1910 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1911...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1911 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1912...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1912 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1913...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1913 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1914...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1914 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1915...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1915 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1916...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1916 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1917...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1917 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1918...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1918 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1919...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1919 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1920...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1920 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1921...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1921 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1922...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1922 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1923...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1923 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1924...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1924 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1925...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1925 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1926...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1926 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1927...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1927 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1928...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1928 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1929...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1929 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1930...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1930 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1931...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1931 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1932...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1932 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1933...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1933 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1934...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1934 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1935...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1935 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1936...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1936 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1937...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1937 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1938...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1938 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1939...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1939 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1940...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1940 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1941...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1941 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1942...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1942 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1943...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1943 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1944...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1944 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1945...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1945 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1946...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1946 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1947...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1947 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1948...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1948 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1949...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1949 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1950...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1950 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1951...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1951 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1952...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1952 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1953...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1953 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1954...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1954 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1955...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1955 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1956...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1956 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1957...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1957 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1958...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1958 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1959...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1959 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1960...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1960 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1961...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1961 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1962...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1962 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1963...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1963 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1964...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1964 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1965...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1965 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1966...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1966 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1967...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1967 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1968...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1968 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1969...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1969 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1970...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1970 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1971...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1971 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1972...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1972 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1973...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1973 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1974...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1974 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1975...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1975 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1976...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1976 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1977...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1977 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1978...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1978 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1979...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1979 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1980...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1980 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1981...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1981 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1982...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1982 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1983...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1983 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1984...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1984 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1985...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1985 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1986...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1986 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1987...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1987 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1988...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1988 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1989...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1989 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1990...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1990 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1991...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1991 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1992...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1992 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1993...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1993 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1994...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1994 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1995...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1995 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1996...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1996 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1997...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1997 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1998...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1998 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "1999...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=1999 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2000...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2000 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2001...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2001 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2002...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2002 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2003...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2003 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2004...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2004 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2005...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2005 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2006...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2006 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2007...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2007 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2008...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2008 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2009...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2009 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2010...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2010 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2011...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2011 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2012...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2012 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2013...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2013 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2014...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2014 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2015...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2015 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2016...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2016 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2017...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2017 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2018...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2018 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2019...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2019 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "2020...\n",
      "\n",
      "    CALL algo.labelPropagation('\n",
      "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WHERE y.value<=2020 AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
      "    RETURN id(a) AS id\n",
      "    ','\n",
      "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
      "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
      "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
      "    ',{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'})\n",
      "//    YIELD nodes, communityCount, iterations, didConverge, \n",
      "//        loadMillis, computeMillis, writeMillis, \n",
      "//        write, weightProperty, writeProperty,\n",
      "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
      "    \n",
      "Query completed in 0.00 minutes.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Write community detection\n",
    "min_year, max_year = 1900, 2020\n",
    "for y in tqdm(range(min_year, max_year+1)):\n",
    "    print(\"{}...\".format(y))\n",
    "        \n",
    "    # Write edge list for graph at year=y\n",
    "    query = \"\"\"\n",
    "    CALL algo.labelPropagation('\n",
    "    MATCH (a:Author)-[:AUTHORED]->(:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
    "    WHERE y.value<={year} AND ((a)-[:COAUTHOR]-(:Author)) AND id(a)<>0\n",
    "    RETURN id(a) AS id\n",
    "    ','\n",
    "    MATCH (a1:Author)-[r:COAUTHOR]-(a2:Author)\n",
    "    WHERE id(a1)<>0 AND id(a2) <> 0\n",
    "    RETURN id(a1) AS source, id(a2) AS target, r.strength AS weight \n",
    "    ',{{graph:'cypher', direction:'BOTH', write:true, writeProperty:'temporary'}})\n",
    "//    YIELD nodes, communityCount, iterations, didConverge, \n",
    "//        loadMillis, computeMillis, writeMillis, \n",
    "//        write, weightProperty, writeProperty,\n",
    "//        p1, p5, p10, p25, p50, p75, p90, p95, p99, p100;\n",
    "    \"\"\".format(year=y)\n",
    "    run_query(query, graph, print_only=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    MATCH (q:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WITH DISTINCT q, y.value as year \n",
      "    MATCH (p:Quanta)-[:CITES]->(q:Quanta) \n",
      "    WHERE p.year = year+0\n",
      "    WITH DISTINCT p, q, year\n",
      "    RETURN [p,q,year] as l\n",
      "    \",\"\n",
      "    WITH l[0] AS p, l[1] AS q, l[2] as year\n",
      "    MATCH (a:Author)-[:AUTHORED]->(p) \n",
      "    WITH q, year+0 as p1, apoc.coll.toSet(collect(a.name)) AS alist \n",
      "    MERGE (q)-[m1:METRICS_IN]->(a:Year {value: p1})\n",
      "    SET m1.earlyAdopters = size(alist)\n",
      "    \",{batchSize:5000, iterateList:true, parallel:false});\n",
      "    \n",
      "\n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    MATCH (q:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WITH DISTINCT q, y.value as year \n",
      "    MATCH (p:Quanta)-[:CITES]->(q:Quanta) \n",
      "    WHERE p.year = year+1\n",
      "    WITH DISTINCT p, q, year\n",
      "    RETURN [p,q,year] as l\n",
      "    \",\"\n",
      "    WITH l[0] AS p, l[1] AS q, l[2] as year\n",
      "    MATCH (a:Author)-[:AUTHORED]->(p) \n",
      "    WITH q, year+1 as p1, apoc.coll.toSet(collect(a.name)) AS alist \n",
      "    MERGE (q)-[m1:METRICS_IN]->(a:Year {value: p1})\n",
      "    SET m1.earlyAdopters = size(alist)\n",
      "    \",{batchSize:5000, iterateList:true, parallel:false});\n",
      "    \n",
      "\n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    MATCH (q:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WITH DISTINCT q, y.value as year \n",
      "    MATCH (p:Quanta)-[:CITES]->(q:Quanta) \n",
      "    WHERE p.year = year+2\n",
      "    WITH DISTINCT p, q, year\n",
      "    RETURN [p,q,year] as l\n",
      "    \",\"\n",
      "    WITH l[0] AS p, l[1] AS q, l[2] as year\n",
      "    MATCH (a:Author)-[:AUTHORED]->(p) \n",
      "    WITH q, year+2 as p1, apoc.coll.toSet(collect(a.name)) AS alist \n",
      "    MERGE (q)-[m1:METRICS_IN]->(a:Year {value: p1})\n",
      "    SET m1.earlyAdopters = size(alist)\n",
      "    \",{batchSize:5000, iterateList:true, parallel:false});\n",
      "    \n",
      "\n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    MATCH (q:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
      "    WITH DISTINCT q, y.value as year \n",
      "    MATCH (p:Quanta)-[:CITES]->(q:Quanta) \n",
      "    WHERE p.year = year+3\n",
      "    WITH DISTINCT p, q, year\n",
      "    RETURN [p,q,year] as l\n",
      "    \",\"\n",
      "    WITH l[0] AS p, l[1] AS q, l[2] as year\n",
      "    MATCH (a:Author)-[:AUTHORED]->(p) \n",
      "    WITH q, year+3 as p1, apoc.coll.toSet(collect(a.name)) AS alist \n",
      "    MERGE (q)-[m1:METRICS_IN]->(a:Year {value: p1})\n",
      "    SET m1.earlyAdopters = size(alist)\n",
      "    \",{batchSize:5000, iterateList:true, parallel:false});\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "for years_post_pub in range(4):\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\"\n",
    "    MATCH (q:Quanta)-[:PUBLISHED_IN]->(y:Year)\n",
    "    WITH DISTINCT q, y.value as year \n",
    "    MATCH (p:Quanta)-[:CITES]->(q:Quanta) \n",
    "    WHERE p.year = year+{}\n",
    "    WITH DISTINCT p, q, year\n",
    "    RETURN [p,q,year] as l\n",
    "    \",\"\n",
    "    WITH l[0] AS p, l[1] AS q, l[2] as year\n",
    "    MATCH (a:Author)-[:AUTHORED]->(p) \n",
    "    WITH q, year+{} as p1, apoc.coll.toSet(collect(a.name)) AS alist \n",
    "    MERGE (q)-[m1:METRICS_IN]->(a:Year {{value: p1}})\n",
    "    SET m1.earlyAdopters = size(alist)\n",
    "    \",{{batchSize:5000, iterateList:true, parallel:false}});\n",
    "    \"\"\".format(years_post_pub, years_post_pub)\n",
    "    print(query)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
