{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "import json\n",
    "import math\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt\n",
    "from scipy import stats\n",
    "from py2neo import Graph, Node, Relationship\n",
    "%matplotlib inline\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_to_df(query, graph):\n",
    "    print(\"Starting query...\", end=\" \")\n",
    "    query_start_time = time.time()\n",
    "    df = graph.run(query).to_data_frame()\n",
    "    print(\"Done ({:.2f} minutes).\".format((time.time()-query_start_time)/60))\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to graph database with 278,590,931 nodes and 1,844,902,937 relationships!\n"
     ]
    }
   ],
   "source": [
    "graph = Graph( \"bolt://matlaber10.media.mit.edu:7687\", auth=('neo4j','myneo'))\n",
    "print(\"Connected to graph database with {:,} nodes and {:,} relationships!\".format(\n",
    "    graph.database.primitive_counts['NumberOfNodeIdsInUse'], \n",
    "    graph.database.primitive_counts['NumberOfRelationshipIdsInUse']))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Community focus"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"call apoc.export.csv.query(\"\n",
    "\n",
    "// denominator\n",
    "\n",
    "MATCH (u:NatureAuthor)\n",
    "\n",
    "MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "\n",
    "WITH e.strength AS weight, u, COUNT(b) AS k_u\n",
    "\n",
    "WITH u, toFloat(sum(weight*k_u))/sum(k_u) AS den\n",
    "\n",
    "\n",
    "\n",
    "// intracommunity focus\n",
    "\n",
    "OPTIONAL MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "\n",
    "WHERE last(b.louvain) = last(u.louvain)\n",
    "\n",
    "WITH den, u, COUNT(b) AS k_intra_u, CASE WHEN e IS NULL THEN 0 ELSE e.strength END AS weight\n",
    "\n",
    "WITH den, u, CASE WHEN sum(k_intra_u)=0 THEN 0 ELSE toFloat(sum(weight*k_intra_u))/sum(k_intra_u) END AS num\n",
    "\n",
    "WITH den, u, CASE WHEN den=0 THEN 0 ELSE num/den END AS NatureIntraCommunityFocus\n",
    "\n",
    "WITH den, u, NatureIntraCommunityFocus\n",
    "\n",
    "\n",
    "\n",
    "// intercommunity focus\n",
    "\n",
    "OPTIONAL MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "\n",
    "WHERE last(b.louvain) <> last(u.louvain)\n",
    "\n",
    "WITH den, u, NatureIntraCommunityFocus, COUNT(b) AS k_inter_u, CASE WHEN e IS NULL THEN 0 ELSE e.strength END AS weight\n",
    "\n",
    "WITH den, u, NatureIntraCommunityFocus, CASE WHEN sum(k_inter_u)=0 THEN 0 ELSE toFloat(sum(weight*k_inter_u))/sum(k_inter_u) END AS num\n",
    "\n",
    "WITH u, NatureIntraCommunityFocus, CASE WHEN den=0 THEN 0 ELSE num/den END AS NatureInterCommunityFocus\n",
    "\n",
    "\n",
    "\n",
    "RETURN u.name, NatureIntraCommunityFocus, NatureInterCommunityFocus\n",
    "\n",
    "\",\"/import/result/author_focus.csv\",{})\"\"\"\n",
    "\n",
    "df_community_focus = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Professor connections"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Augment nodes with pct_last_author\n",
    "query = \"\"\"call apoc.periodic.iterate(\n",
    "\"MATCH (a:Top42Author) RETURN a\",\n",
    "\"MATCH (a)-[r:AUTHORED]->(:Quanta)\n",
    "WITH a, toFloat(SUM(CASE WHEN r.is_last_author THEN 1 ELSE 0 END))/COUNT(r) as pct_last_author\n",
    "SET a.pct_last_author = pct_last_author\", {batchSize:100, parallel:true})\n",
    "\"\"\"\n",
    "\n",
    "df_last_author = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)-[:AUTHORED]-(b:NatureAuthor)\n",
    "    WHERE b.pct_last_author > .5\n",
    "    WITH a, num_pubs, COUNT(distinct q) as num_coauthored_with_prof\n",
    "    RETURN a.name AS name, num_coauthored_with_prof as num_pubs_with_prof, num_pubs, toFloat(num_coauthored_with_prof)/num_pubs AS ratio_pubs_with_prof\n",
    "\"\"\"\n",
    "profs_per_paper = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "profs_per_paper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "profs_per_paper.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\paper.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Ratio of prof-prof connected papers\n",
    "#WORKING\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WITH a, COUNT(q) AS num_pubs\n",
    "MATCH (a)-[r:COAUTHOR]-(b:NatureAuthor)\n",
    "WHERE b.pct_last_author > .5\n",
    "WITH a, num_pubs, SUM(r.strength42) as num_coauthored_with_prof\n",
    "RETURN a.name AS name, num_coauthored_with_prof as prof_connections, num_pubs, toFloat(num_coauthored_with_prof)/num_pubs AS coauthor_profs_ratio\"\"\"\n",
    "\n",
    "df_coauthor_profs_ratio = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_coauthor_papers_ratio.sort_values('coauthor_profs_ratio', ascending=False).tail(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_coauthor_profs_ratio.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\coauthor_profs_ratio.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Cross-cluster edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Ratio of cross-cluster and intra-cluster edges to total edges\n",
    "#WORKING\n",
    "query = \"\"\"\n",
    "MATCH (u:NatureAuthor)\n",
    "MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "WITH u, COUNT(b) AS k_u\n",
    "WITH u, k_u AS den\n",
    "\n",
    "// intracommunity edges\n",
    "OPTIONAL MATCH (u)-[e:COAUTHOR]-(b:NatureAuthor)\n",
    "WHERE last(b.louvain) = last(u.louvain)\n",
    "WITH den, u, COUNT(b) AS k_intra_u\n",
    "WITH den, u, k_intra_u AS IntraClusterConns, CASE WHEN den=0 THEN 0 ELSE toFloat(k_intra_u)/den END AS IntraClusterRatio\n",
    "WITH den, u, IntraClusterRatio, IntraClusterConns, 1.0 - IntraClusterRatio AS InterClusterRatio\n",
    "\n",
    "RETURN u.name AS name, IntraClusterRatio, InterClusterRatio, den AS TotalConns, IntraClusterConns, den - IntraClusterConns AS InterClusterConns\n",
    "\"\"\"\n",
    "\n",
    "df_clusters = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clusters.head(15)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clusters.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\clusters.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Preparing metrics csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clusters = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\clusters.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_papers = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\papers.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_profs = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\profs.csv', index_col = 'name', encoding = 'UTF-8')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_profs_papers = df_profs.join(df_papers[['num_pubs_with_prof', 'ratio_pubs_with_prof']], how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all = df_profs_papers.join(df_clusters, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_author_focus = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\author_focus.csv', index_col = 'name', encoding = 'UTF-8')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all = df_all.join(df_author_focus, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\metrics.csv', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### All metrics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_metrics = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\metrics.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import random\n",
    "indices = []\n",
    "for i in range(10):\n",
    "    indices.append(random.randrange(0, df_metrics.shape[0]))\n",
    "df_metrics.iloc[indices]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Impact"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#    CALL algo.pageRank(\n",
    "#     'MATCH (p:Quanta {venue:\"Nature\"}) RETURN id(p) as id',\n",
    "#     'MATCH (p1:Quanta {venue:\"Nature\"})-[:CITES]->(p2:Quanta {venue:\"Nature\"}) RETURN id(p1) as source, id(p2) as target',\n",
    "#     {graph:'cypher', iterations:35, write:true, writeProperty:\"npr\"});"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue = 'Nature'\n",
    "WITH a, COUNT(q) AS num_pubs, SUM(q.npr) AS tot_rank, MIN(q.npr) AS min_rank, MAX(q.npr) AS max_rank, percentileCont(q.npr, 0.5) AS median_rank \n",
    "RETURN a.name AS name, num_pubs, toFloat(tot_rank)/num_pubs AS avg_NPR, min_rank AS min_NPR, max_rank AS max_NPR, median_rank AS median_NPR\n",
    "\"\"\"\n",
    "\n",
    "df_npr = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_npr.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue = 'Nature'\n",
    "WITH a, COUNT(q) AS num_pubs, SUM(q.nar) AS tot_rank, MIN(q.nar) AS min_rank, MAX(q.nar) AS max_rank, percentileCont(q.nar, 0.5) AS median_rank \n",
    "RETURN a.name AS name, num_pubs, toFloat(tot_rank)/num_pubs AS avg_NAR, min_rank AS min_NAR, max_rank AS max_NAR, median_rank AS median_NAR\n",
    "\"\"\"\n",
    "\n",
    "df_nar = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_nar.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_npr.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\npr.csv', index = False, encoding = \"UTF-8\")\n",
    "df_nar.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\nar.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue = 'Nature'\n",
    "WITH a, COUNT(q) AS num_pubs, SUM(q.pageRank_2018) AS tot_rank, MIN(q.pageRank_2018) AS min_rank, MAX(q.pageRank_2018) AS max_rank, percentileCont(q.pageRank_2018, 0.5) AS median_rank \n",
    "RETURN a.name AS name, num_pubs, toFloat(tot_rank)/num_pubs AS avg_PR, min_rank AS min_PR, max_rank AS max_PR, median_rank AS median_PR\n",
    "\"\"\"\n",
    "\n",
    "df_pr = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_pr.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue = 'Nature'\n",
    "WITH a, COUNT(q) AS num_pubs, SUM(q.articleRank2018) AS tot_rank, MIN(q.articleRank2018) AS min_rank, MAX(q.articleRank2018) AS max_rank, percentileCont(q.articleRank2018, 0.5) AS median_rank \n",
    "RETURN a.name AS name, num_pubs, toFloat(tot_rank)/num_pubs AS avg_AR, min_rank AS min_AR, max_rank AS max_AR, median_rank AS median_AR\n",
    "\"\"\"\n",
    "\n",
    "df_ar = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_ar.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_pr.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\pr.csv', index = False, encoding = \"UTF-8\")\n",
    "df_ar.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\ar.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_npr = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\npr.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_nar = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\nar.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_pr = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\pr.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_ar = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\ar.csv', index_col = 'name', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_npr = df_npr[[col for col in df_npr.columns if col != 'num_pubs']]\n",
    "df_nar = df_nar[[col for col in df_nar.columns if col != 'num_pubs']]\n",
    "df_pr = df_pr[[col for col in df_pr.columns if col != 'num_pubs']]\n",
    "df_ar = df_ar[[col for col in df_ar.columns if col != 'num_pubs']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_imp = df_npr.join(df_nar, how = 'outer')\n",
    "df_imp = df_imp.join(df_pr, how = 'outer')\n",
    "df_imp = df_imp.join(df_ar, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_imp.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\impact.csv', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Collaboration vs Impact"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_collab = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\metrics.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_impact = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\impact.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_all = df_collab.join(df_impact, how = 'outer')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\correlation.csv', encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_all[df_all.index == 'Eric S. Lander']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_plot = df_all[['profs_per_pub', 'median_AR']]\n",
    "df_plot = df_plot[df_plot['median_AR'] < 50]\n",
    "df_plot = df_plot[df_plot['median_AR'] > .16]\n",
    "df_plot = df_plot[df_plot['profs_per_pub'] > .1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import seaborn as sns\n",
    "sns.set()\n",
    "sns.relplot(x=\"profs_per_pub\", y=\"median_AR\",  \n",
    "            data=df_plot);"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Deweighted pct_collaborative_pubs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set num_profs property for Eric Lander's publications\n",
    "query = \"\"\"\n",
    "call apoc.periodic.iterate(\n",
    "    \"MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander'\n",
    "    WITH a, COUNT(q) AS num_pubs, COLLECT(q) AS pubs\n",
    "    UNWIND pubs as pub\n",
    "    MATCH (b:NatureAuthor)-[:AUTHORED]-(pub)\n",
    "    WHERE b.pct_last_author > .25\n",
    "    RETURN pub, COUNT(DISTINCT b.name) as num_profs\",\n",
    "   \" SET pub.num_profs = num_profs\",\n",
    " {batchSize:100, parallel:true})\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set num_profs property for all publications\n",
    "query = \"\"\"call apoc.periodic.iterate(\n",
    "    \"MATCH (b:NatureAuthor)-[:AUTHORED]-(pub:Quanta)\n",
    "    WHERE b.pct_last_author > .25\n",
    "    RETURN pub, COUNT(DISTINCT b) as num_profs\",\n",
    "    \"SET pub.num_profs = num_profs\", {batchSize:1000, parallel:true})\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set num_authors property for all publications\n",
    "query = \"\"\"call apoc.periodic.iterate(\n",
    "    \"MATCH (b:NatureAuthor)-[:AUTHORED]-(pub:Quanta)\n",
    "    RETURN pub, COUNT(DISTINCT b) as num_authors\",\n",
    "    \"SET pub.num_authors = num_authors\", {batchSize:1000, parallel:true})\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Eric Lander metrics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.01 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_linprof</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Eric S. Lander</td>\n",
       "      <td>0.389683</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           a.name  pct_collab_linprof\n",
       "0  Eric S. Lander            0.389683"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Linear-prof deweight for pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander' AND  q.profs > 1\n",
    "    WITH a, SUM(toFloat(1)/(q.num_profs - 1)) AS collab_linprof\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_linprof\n",
    "    RETURN a.name, collab_linprof/num_pubs AS pct_collab_linprof\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.01 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_sqrtprof</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Eric S. Lander</td>\n",
       "      <td>0.519778</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           a.name  pct_collab_sqrtprof\n",
       "0  Eric S. Lander             0.519778"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Sqrt-prof deweight for pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander' AND  q.num_profs > 1\n",
    "    WITH a, SUM(toFloat(1)/(sqrt(q.num_profs - 1))) AS collab_sqrtprof\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_sqrtprof\n",
    "    RETURN a.name, collab_sqrtprof/num_pubs AS pct_collab_sqrtprof\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.01 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_unweighted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Eric S. Lander</td>\n",
       "      <td>0.819559</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           a.name  pct_collab_unweighted\n",
       "0  Eric S. Lander               0.819559"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# No deweight for pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander' AND  q.num_profs > 1\n",
    "    WITH a, SUM(toFloat(1)/(q.num_profs + 1 - q.num_profs)) AS collab_unweighted\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_unweighted\n",
    "    RETURN a.name, collab_unweighted/num_pubs AS pct_collab_unweighted\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.01 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_sqrtauth</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Eric S. Lander</td>\n",
       "      <td>0.341184</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           a.name  pct_collab_sqrtauth\n",
       "0  Eric S. Lander             0.341184"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Sqrt-author deweight for pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander' AND  q.num_profs > 1\n",
    "    WITH a, SUM(toFloat(1)/(sqrt(q.num_authors - 1))) AS collab_sqrtauth\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_sqrtauth\n",
    "    RETURN a.name, collab_sqrtauth/num_pubs AS pct_collab_sqrtauth\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.01 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_linauth</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Eric S. Lander</td>\n",
       "      <td>0.187796</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           a.name  pct_collab_linauth\n",
       "0  Eric S. Lander            0.187796"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Linear-author deweight for pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander' AND  q.profs > 1\n",
    "    WITH a, SUM(toFloat(1)/(q.num_authors - 1)) AS collab_linauth\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_linauth\n",
    "    RETURN a.name, collab_linauth/num_pubs AS pct_collab_linauth\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.01 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_linauth</th>\n",
       "      <th>pct_collab_linprof</th>\n",
       "      <th>pct_collab_sqrtauth</th>\n",
       "      <th>pct_collab_sqrtprof</th>\n",
       "      <th>pct_collab_unweighted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Eric S. Lander</td>\n",
       "      <td>0.187796</td>\n",
       "      <td>0.389683</td>\n",
       "      <td>0.341184</td>\n",
       "      <td>0.519778</td>\n",
       "      <td>0.819559</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           a.name  pct_collab_linauth  pct_collab_linprof  \\\n",
       "0  Eric S. Lander            0.187796            0.389683   \n",
       "\n",
       "   pct_collab_sqrtauth  pct_collab_sqrtprof  pct_collab_unweighted  \n",
       "0             0.341184             0.519778               0.819559  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# All versions of pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE a.name = 'Eric S. Lander' AND q.num_profs > 1\n",
    "    WITH a, \n",
    "        SUM(toFloat(1)/(q.num_profs - 1)) AS collab_linprof,\n",
    "        SUM(toFloat(1)/(sqrt(q.num_profs - 1))) AS collab_sqrtprof,\n",
    "        SUM(toFloat(1)/(sqrt(q.num_authors - 1))) AS collab_sqrtauth,\n",
    "        SUM(toFloat(1)/(q.num_authors - 1)) AS collab_linauth,\n",
    "        SUM(toFloat(1)/(q.num_profs + 1 - q.num_profs)) AS collab_unweighted\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_linprof, collab_sqrtauth, collab_linauth, collab_unweighted, collab_sqrtprof\n",
    "    RETURN a.name, \n",
    "        collab_linprof/num_pubs AS pct_collab_linprof,\n",
    "        collab_sqrtprof/num_pubs AS pct_collab_sqrtprof,\n",
    "        collab_unweighted/num_pubs AS pct_collab_unweighted,\n",
    "        collab_sqrtauth/num_pubs AS pct_collab_sqrtauth,\n",
    "        collab_linauth/num_pubs AS pct_collab_linauth\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "All authors"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (32.63 minutes).\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>pct_collab_linauth</th>\n",
       "      <th>pct_collab_linprof</th>\n",
       "      <th>pct_collab_sqrtauth</th>\n",
       "      <th>pct_collab_sqrtprof</th>\n",
       "      <th>pct_collab_unweighted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Arthur Zelent</td>\n",
       "      <td>0.394172</td>\n",
       "      <td>0.506783</td>\n",
       "      <td>0.510950</td>\n",
       "      <td>0.590900</td>\n",
       "      <td>0.720930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Leah A. Santat</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.377964</td>\n",
       "      <td>0.707107</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Cameron D. Hinman</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.090909</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Jan H. van Esch</td>\n",
       "      <td>0.438798</td>\n",
       "      <td>0.516393</td>\n",
       "      <td>0.498789</td>\n",
       "      <td>0.548765</td>\n",
       "      <td>0.598361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Karen A. Gelmon</td>\n",
       "      <td>0.033411</td>\n",
       "      <td>0.086911</td>\n",
       "      <td>0.058972</td>\n",
       "      <td>0.097572</td>\n",
       "      <td>0.115486</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B H Briggs</td>\n",
       "      <td>0.312500</td>\n",
       "      <td>0.312500</td>\n",
       "      <td>0.312500</td>\n",
       "      <td>0.312500</td>\n",
       "      <td>0.312500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Anthony P. Millman</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.142857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>J. A. Henry</td>\n",
       "      <td>0.162634</td>\n",
       "      <td>0.180108</td>\n",
       "      <td>0.199112</td>\n",
       "      <td>0.211362</td>\n",
       "      <td>0.258065</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>K. L. Kimball</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.707107</td>\n",
       "      <td>0.707107</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>K Chism</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>0.166667</td>\n",
       "      <td>0.166667</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Barry Madore</td>\n",
       "      <td>0.050000</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.182291</td>\n",
       "      <td>0.471405</td>\n",
       "      <td>0.666667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Goldman Bs</td>\n",
       "      <td>0.177778</td>\n",
       "      <td>0.237037</td>\n",
       "      <td>0.212455</td>\n",
       "      <td>0.247882</td>\n",
       "      <td>0.266667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Jh Zhao</td>\n",
       "      <td>0.026984</td>\n",
       "      <td>0.035714</td>\n",
       "      <td>0.062032</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>0.142857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Samuel E. Campbell</td>\n",
       "      <td>0.059524</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.112668</td>\n",
       "      <td>0.172444</td>\n",
       "      <td>0.214286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Barbara A. Wible</td>\n",
       "      <td>0.121212</td>\n",
       "      <td>0.309091</td>\n",
       "      <td>0.192155</td>\n",
       "      <td>0.309091</td>\n",
       "      <td>0.309091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Edwin F. Shaw</td>\n",
       "      <td>0.583333</td>\n",
       "      <td>0.750000</td>\n",
       "      <td>0.644338</td>\n",
       "      <td>0.750000</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Kevin D. Courtney</td>\n",
       "      <td>0.034715</td>\n",
       "      <td>0.114613</td>\n",
       "      <td>0.076238</td>\n",
       "      <td>0.141070</td>\n",
       "      <td>0.205882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Jens Wiebe</td>\n",
       "      <td>0.064446</td>\n",
       "      <td>0.171642</td>\n",
       "      <td>0.113703</td>\n",
       "      <td>0.187098</td>\n",
       "      <td>0.208955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>G. T. Archer</td>\n",
       "      <td>0.105263</td>\n",
       "      <td>0.105263</td>\n",
       "      <td>0.105263</td>\n",
       "      <td>0.105263</td>\n",
       "      <td>0.105263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Kenneth J. Livak</td>\n",
       "      <td>0.031064</td>\n",
       "      <td>0.086316</td>\n",
       "      <td>0.064640</td>\n",
       "      <td>0.110191</td>\n",
       "      <td>0.161017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Naoto Nagaosa</td>\n",
       "      <td>0.265819</td>\n",
       "      <td>0.313893</td>\n",
       "      <td>0.313867</td>\n",
       "      <td>0.349024</td>\n",
       "      <td>0.404568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Bruce Kleger</td>\n",
       "      <td>0.191667</td>\n",
       "      <td>0.200000</td>\n",
       "      <td>0.214223</td>\n",
       "      <td>0.220711</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Christel Genoud</td>\n",
       "      <td>0.082091</td>\n",
       "      <td>0.208333</td>\n",
       "      <td>0.154125</td>\n",
       "      <td>0.246087</td>\n",
       "      <td>0.304348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Kei Nagano</td>\n",
       "      <td>0.577303</td>\n",
       "      <td>0.694627</td>\n",
       "      <td>0.670390</td>\n",
       "      <td>0.744603</td>\n",
       "      <td>0.828947</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Mamie Yu</td>\n",
       "      <td>0.089193</td>\n",
       "      <td>0.326389</td>\n",
       "      <td>0.236969</td>\n",
       "      <td>0.442338</td>\n",
       "      <td>0.666667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Liang Shan</td>\n",
       "      <td>0.063023</td>\n",
       "      <td>0.094271</td>\n",
       "      <td>0.078852</td>\n",
       "      <td>0.099927</td>\n",
       "      <td>0.109170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Richard Broadhead</td>\n",
       "      <td>0.053333</td>\n",
       "      <td>0.166667</td>\n",
       "      <td>0.144895</td>\n",
       "      <td>0.256891</td>\n",
       "      <td>0.400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Wall Pd</td>\n",
       "      <td>0.029982</td>\n",
       "      <td>0.032099</td>\n",
       "      <td>0.055308</td>\n",
       "      <td>0.057873</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>A.H. Dahl</td>\n",
       "      <td>0.611111</td>\n",
       "      <td>0.611111</td>\n",
       "      <td>0.618782</td>\n",
       "      <td>0.618782</td>\n",
       "      <td>0.629630</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Douglas S. Portman</td>\n",
       "      <td>0.327586</td>\n",
       "      <td>0.327586</td>\n",
       "      <td>0.334728</td>\n",
       "      <td>0.334728</td>\n",
       "      <td>0.344828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265017</th>\n",
       "      <td>J. D. Hamilton Dickson</td>\n",
       "      <td>0.111111</td>\n",
       "      <td>0.111111</td>\n",
       "      <td>0.111111</td>\n",
       "      <td>0.111111</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265018</th>\n",
       "      <td>Claus Rerup</td>\n",
       "      <td>0.234670</td>\n",
       "      <td>0.234838</td>\n",
       "      <td>0.335478</td>\n",
       "      <td>0.335708</td>\n",
       "      <td>0.537736</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265019</th>\n",
       "      <td>Susan Bort</td>\n",
       "      <td>0.080169</td>\n",
       "      <td>0.400000</td>\n",
       "      <td>0.274582</td>\n",
       "      <td>0.579057</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265020</th>\n",
       "      <td>Miroslav Král</td>\n",
       "      <td>0.259269</td>\n",
       "      <td>0.297619</td>\n",
       "      <td>0.326701</td>\n",
       "      <td>0.357732</td>\n",
       "      <td>0.464286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265021</th>\n",
       "      <td>H. Kimura</td>\n",
       "      <td>0.199804</td>\n",
       "      <td>0.291796</td>\n",
       "      <td>0.252138</td>\n",
       "      <td>0.315925</td>\n",
       "      <td>0.357201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265022</th>\n",
       "      <td>Kenneth Tape</td>\n",
       "      <td>0.482684</td>\n",
       "      <td>0.490909</td>\n",
       "      <td>0.563675</td>\n",
       "      <td>0.573513</td>\n",
       "      <td>0.727273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265023</th>\n",
       "      <td>Thomas W. White</td>\n",
       "      <td>0.271007</td>\n",
       "      <td>0.312500</td>\n",
       "      <td>0.312994</td>\n",
       "      <td>0.340044</td>\n",
       "      <td>0.380208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265024</th>\n",
       "      <td>Xiaolong Fan</td>\n",
       "      <td>0.012964</td>\n",
       "      <td>0.036976</td>\n",
       "      <td>0.027155</td>\n",
       "      <td>0.045734</td>\n",
       "      <td>0.059603</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265025</th>\n",
       "      <td>Gerard R. Miller</td>\n",
       "      <td>0.133333</td>\n",
       "      <td>0.200000</td>\n",
       "      <td>0.230940</td>\n",
       "      <td>0.282843</td>\n",
       "      <td>0.400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265026</th>\n",
       "      <td>Alexei Redkozubov</td>\n",
       "      <td>0.035714</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>0.050508</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>0.071429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265027</th>\n",
       "      <td>Marc Himmelbach</td>\n",
       "      <td>0.551020</td>\n",
       "      <td>0.561224</td>\n",
       "      <td>0.584834</td>\n",
       "      <td>0.590811</td>\n",
       "      <td>0.632653</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265028</th>\n",
       "      <td>Marion K. Cooney</td>\n",
       "      <td>0.031092</td>\n",
       "      <td>0.062745</td>\n",
       "      <td>0.046041</td>\n",
       "      <td>0.065616</td>\n",
       "      <td>0.070588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265029</th>\n",
       "      <td>Diana Bolotin</td>\n",
       "      <td>0.040123</td>\n",
       "      <td>0.148148</td>\n",
       "      <td>0.076939</td>\n",
       "      <td>0.148148</td>\n",
       "      <td>0.148148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265030</th>\n",
       "      <td>R. A. Cleghorn</td>\n",
       "      <td>0.093137</td>\n",
       "      <td>0.093137</td>\n",
       "      <td>0.095168</td>\n",
       "      <td>0.095168</td>\n",
       "      <td>0.098039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265031</th>\n",
       "      <td>Albrecht Werner</td>\n",
       "      <td>0.453672</td>\n",
       "      <td>0.615819</td>\n",
       "      <td>0.552836</td>\n",
       "      <td>0.660022</td>\n",
       "      <td>0.728814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265032</th>\n",
       "      <td>I. Leslie</td>\n",
       "      <td>0.448276</td>\n",
       "      <td>0.448276</td>\n",
       "      <td>0.505409</td>\n",
       "      <td>0.505409</td>\n",
       "      <td>0.586207</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265033</th>\n",
       "      <td>J. Douglas Waterfield</td>\n",
       "      <td>0.397727</td>\n",
       "      <td>0.397727</td>\n",
       "      <td>0.418505</td>\n",
       "      <td>0.418505</td>\n",
       "      <td>0.454545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265034</th>\n",
       "      <td>William Watt</td>\n",
       "      <td>0.166667</td>\n",
       "      <td>0.170000</td>\n",
       "      <td>0.171547</td>\n",
       "      <td>0.174142</td>\n",
       "      <td>0.180000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265035</th>\n",
       "      <td>Inessa Hakker</td>\n",
       "      <td>0.209674</td>\n",
       "      <td>0.675758</td>\n",
       "      <td>0.407032</td>\n",
       "      <td>0.741687</td>\n",
       "      <td>0.900000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265036</th>\n",
       "      <td>Kelinda Tucker</td>\n",
       "      <td>0.003965</td>\n",
       "      <td>0.019828</td>\n",
       "      <td>0.062670</td>\n",
       "      <td>0.139892</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265037</th>\n",
       "      <td>Robin M. Bannerman</td>\n",
       "      <td>0.247159</td>\n",
       "      <td>0.291126</td>\n",
       "      <td>0.288794</td>\n",
       "      <td>0.316975</td>\n",
       "      <td>0.363636</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265038</th>\n",
       "      <td>Ian F.G. King</td>\n",
       "      <td>0.055556</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>0.096225</td>\n",
       "      <td>0.117851</td>\n",
       "      <td>0.166667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265039</th>\n",
       "      <td>Alan H. Colen</td>\n",
       "      <td>0.600000</td>\n",
       "      <td>0.600000</td>\n",
       "      <td>0.662132</td>\n",
       "      <td>0.662132</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265040</th>\n",
       "      <td>Fabio A. Capitanio</td>\n",
       "      <td>0.317376</td>\n",
       "      <td>0.413121</td>\n",
       "      <td>0.392189</td>\n",
       "      <td>0.450856</td>\n",
       "      <td>0.510638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265041</th>\n",
       "      <td>Thomas Briggs</td>\n",
       "      <td>0.120491</td>\n",
       "      <td>0.140693</td>\n",
       "      <td>0.153837</td>\n",
       "      <td>0.166645</td>\n",
       "      <td>0.212121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265042</th>\n",
       "      <td>V. Kottsov</td>\n",
       "      <td>0.056206</td>\n",
       "      <td>0.270408</td>\n",
       "      <td>0.191869</td>\n",
       "      <td>0.441231</td>\n",
       "      <td>0.857143</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265043</th>\n",
       "      <td>Jacques Rougemont</td>\n",
       "      <td>0.052478</td>\n",
       "      <td>0.155792</td>\n",
       "      <td>0.113262</td>\n",
       "      <td>0.197115</td>\n",
       "      <td>0.275000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265044</th>\n",
       "      <td>Luis C. Ho</td>\n",
       "      <td>0.259127</td>\n",
       "      <td>0.422788</td>\n",
       "      <td>0.383061</td>\n",
       "      <td>0.505519</td>\n",
       "      <td>0.657627</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265045</th>\n",
       "      <td>A. L. Hudson</td>\n",
       "      <td>0.297627</td>\n",
       "      <td>0.360219</td>\n",
       "      <td>0.477180</td>\n",
       "      <td>0.517620</td>\n",
       "      <td>0.850000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265046</th>\n",
       "      <td>Morton P. Printz</td>\n",
       "      <td>0.203201</td>\n",
       "      <td>0.242315</td>\n",
       "      <td>0.244719</td>\n",
       "      <td>0.270741</td>\n",
       "      <td>0.316667</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>265047 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                        a.name  pct_collab_linauth  pct_collab_linprof  \\\n",
       "0                Arthur Zelent            0.394172            0.506783   \n",
       "1               Leah A. Santat            0.142857            0.500000   \n",
       "2            Cameron D. Hinman            0.090909            0.090909   \n",
       "3              Jan H. van Esch            0.438798            0.516393   \n",
       "4              Karen A. Gelmon            0.033411            0.086911   \n",
       "5                   B H Briggs            0.312500            0.312500   \n",
       "6           Anthony P. Millman            0.142857            0.142857   \n",
       "7                  J. A. Henry            0.162634            0.180108   \n",
       "8                K. L. Kimball            0.500000            0.500000   \n",
       "9                      K Chism            0.083333            0.083333   \n",
       "10                Barry Madore            0.050000            0.333333   \n",
       "11                  Goldman Bs            0.177778            0.237037   \n",
       "12                     Jh Zhao            0.026984            0.035714   \n",
       "13          Samuel E. Campbell            0.059524            0.142857   \n",
       "14            Barbara A. Wible            0.121212            0.309091   \n",
       "15               Edwin F. Shaw            0.583333            0.750000   \n",
       "16           Kevin D. Courtney            0.034715            0.114613   \n",
       "17                  Jens Wiebe            0.064446            0.171642   \n",
       "18                G. T. Archer            0.105263            0.105263   \n",
       "19            Kenneth J. Livak            0.031064            0.086316   \n",
       "20               Naoto Nagaosa            0.265819            0.313893   \n",
       "21                Bruce Kleger            0.191667            0.200000   \n",
       "22             Christel Genoud            0.082091            0.208333   \n",
       "23                  Kei Nagano            0.577303            0.694627   \n",
       "24                    Mamie Yu            0.089193            0.326389   \n",
       "25                  Liang Shan            0.063023            0.094271   \n",
       "26           Richard Broadhead            0.053333            0.166667   \n",
       "27                     Wall Pd            0.029982            0.032099   \n",
       "28                   A.H. Dahl            0.611111            0.611111   \n",
       "29          Douglas S. Portman            0.327586            0.327586   \n",
       "...                        ...                 ...                 ...   \n",
       "265017  J. D. Hamilton Dickson            0.111111            0.111111   \n",
       "265018             Claus Rerup            0.234670            0.234838   \n",
       "265019              Susan Bort            0.080169            0.400000   \n",
       "265020           Miroslav Král            0.259269            0.297619   \n",
       "265021               H. Kimura            0.199804            0.291796   \n",
       "265022            Kenneth Tape            0.482684            0.490909   \n",
       "265023         Thomas W. White            0.271007            0.312500   \n",
       "265024            Xiaolong Fan            0.012964            0.036976   \n",
       "265025        Gerard R. Miller            0.133333            0.200000   \n",
       "265026       Alexei Redkozubov            0.035714            0.071429   \n",
       "265027         Marc Himmelbach            0.551020            0.561224   \n",
       "265028        Marion K. Cooney            0.031092            0.062745   \n",
       "265029           Diana Bolotin            0.040123            0.148148   \n",
       "265030          R. A. Cleghorn            0.093137            0.093137   \n",
       "265031         Albrecht Werner            0.453672            0.615819   \n",
       "265032               I. Leslie            0.448276            0.448276   \n",
       "265033   J. Douglas Waterfield            0.397727            0.397727   \n",
       "265034            William Watt            0.166667            0.170000   \n",
       "265035           Inessa Hakker            0.209674            0.675758   \n",
       "265036          Kelinda Tucker            0.003965            0.019828   \n",
       "265037      Robin M. Bannerman            0.247159            0.291126   \n",
       "265038           Ian F.G. King            0.055556            0.083333   \n",
       "265039           Alan H. Colen            0.600000            0.600000   \n",
       "265040      Fabio A. Capitanio            0.317376            0.413121   \n",
       "265041           Thomas Briggs            0.120491            0.140693   \n",
       "265042              V. Kottsov            0.056206            0.270408   \n",
       "265043       Jacques Rougemont            0.052478            0.155792   \n",
       "265044              Luis C. Ho            0.259127            0.422788   \n",
       "265045            A. L. Hudson            0.297627            0.360219   \n",
       "265046        Morton P. Printz            0.203201            0.242315   \n",
       "\n",
       "        pct_collab_sqrtauth  pct_collab_sqrtprof  pct_collab_unweighted  \n",
       "0                  0.510950             0.590900               0.720930  \n",
       "1                  0.377964             0.707107               1.000000  \n",
       "2                  0.090909             0.090909               0.090909  \n",
       "3                  0.498789             0.548765               0.598361  \n",
       "4                  0.058972             0.097572               0.115486  \n",
       "5                  0.312500             0.312500               0.312500  \n",
       "6                  0.142857             0.142857               0.142857  \n",
       "7                  0.199112             0.211362               0.258065  \n",
       "8                  0.707107             0.707107               1.000000  \n",
       "9                  0.166667             0.166667               0.333333  \n",
       "10                 0.182291             0.471405               0.666667  \n",
       "11                 0.212455             0.247882               0.266667  \n",
       "12                 0.062032             0.071429               0.142857  \n",
       "13                 0.112668             0.172444               0.214286  \n",
       "14                 0.192155             0.309091               0.309091  \n",
       "15                 0.644338             0.750000               0.750000  \n",
       "16                 0.076238             0.141070               0.205882  \n",
       "17                 0.113703             0.187098               0.208955  \n",
       "18                 0.105263             0.105263               0.105263  \n",
       "19                 0.064640             0.110191               0.161017  \n",
       "20                 0.313867             0.349024               0.404568  \n",
       "21                 0.214223             0.220711               0.250000  \n",
       "22                 0.154125             0.246087               0.304348  \n",
       "23                 0.670390             0.744603               0.828947  \n",
       "24                 0.236969             0.442338               0.666667  \n",
       "25                 0.078852             0.099927               0.109170  \n",
       "26                 0.144895             0.256891               0.400000  \n",
       "27                 0.055308             0.057873               0.111111  \n",
       "28                 0.618782             0.618782               0.629630  \n",
       "29                 0.334728             0.334728               0.344828  \n",
       "...                     ...                  ...                    ...  \n",
       "265017             0.111111             0.111111               0.111111  \n",
       "265018             0.335478             0.335708               0.537736  \n",
       "265019             0.274582             0.579057               1.000000  \n",
       "265020             0.326701             0.357732               0.464286  \n",
       "265021             0.252138             0.315925               0.357201  \n",
       "265022             0.563675             0.573513               0.727273  \n",
       "265023             0.312994             0.340044               0.380208  \n",
       "265024             0.027155             0.045734               0.059603  \n",
       "265025             0.230940             0.282843               0.400000  \n",
       "265026             0.050508             0.071429               0.071429  \n",
       "265027             0.584834             0.590811               0.632653  \n",
       "265028             0.046041             0.065616               0.070588  \n",
       "265029             0.076939             0.148148               0.148148  \n",
       "265030             0.095168             0.095168               0.098039  \n",
       "265031             0.552836             0.660022               0.728814  \n",
       "265032             0.505409             0.505409               0.586207  \n",
       "265033             0.418505             0.418505               0.454545  \n",
       "265034             0.171547             0.174142               0.180000  \n",
       "265035             0.407032             0.741687               0.900000  \n",
       "265036             0.062670             0.139892               1.000000  \n",
       "265037             0.288794             0.316975               0.363636  \n",
       "265038             0.096225             0.117851               0.166667  \n",
       "265039             0.662132             0.662132               0.750000  \n",
       "265040             0.392189             0.450856               0.510638  \n",
       "265041             0.153837             0.166645               0.212121  \n",
       "265042             0.191869             0.441231               0.857143  \n",
       "265043             0.113262             0.197115               0.275000  \n",
       "265044             0.383061             0.505519               0.657627  \n",
       "265045             0.477180             0.517620               0.850000  \n",
       "265046             0.244719             0.270741               0.316667  \n",
       "\n",
       "[265047 rows x 6 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# All versions of pct_collaborative_pubs for Eric Lander\n",
    "query = \"\"\"\n",
    "MATCH (a:NatureAuthor)-[:AUTHORED]->(q:Quanta)\n",
    "\tWHERE q.num_profs > 1 AND q.num_authors > 1\n",
    "    WITH a, \n",
    "        SUM(toFloat(1)/(q.num_profs - 1)) AS collab_linprof,\n",
    "        SUM(toFloat(1)/(sqrt(q.num_profs - 1))) AS collab_sqrtprof,\n",
    "        SUM(toFloat(1)/(sqrt(q.num_authors - 1))) AS collab_sqrtauth,\n",
    "        SUM(toFloat(1)/(q.num_authors - 1)) AS collab_linauth,\n",
    "        SUM(toFloat(1)/(q.num_profs + 1 - q.num_profs)) AS collab_unweighted\n",
    "    MATCH (a)-[:AUTHORED]-(q:Quanta)\n",
    "    WITH a, COUNT(q) AS num_pubs, collab_linprof, collab_sqrtauth, collab_linauth, collab_unweighted, collab_sqrtprof\n",
    "    RETURN a.name, \n",
    "        collab_linprof/num_pubs AS pct_collab_linprof,\n",
    "        collab_sqrtprof/num_pubs AS pct_collab_sqrtprof,\n",
    "        collab_unweighted/num_pubs AS pct_collab_unweighted,\n",
    "        collab_sqrtauth/num_pubs AS pct_collab_sqrtauth,\n",
    "        collab_linauth/num_pubs AS pct_collab_linauth\n",
    "    \"\"\"\n",
    "df = query_to_df(query, graph)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\pct_collaborative_pubs.csv', index = False, encoding = \"UTF-8\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_pct_collaborative_pubs = pd.read_csv('C:\\\\Users\\\\Brend\\\\Downloads\\\\pct_collaborative_pubs.csv', index_col = 'name', encoding = 'UTF-8')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pct_collab_linauth_%</th>\n",
       "      <th>pct_collab_linprof_%</th>\n",
       "      <th>pct_collab_sqrtauth_%</th>\n",
       "      <th>pct_collab_sqrtprof_%</th>\n",
       "      <th>pct_collab_unweighted_%</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Eric S. Lander</th>\n",
       "      <td>0.611609</td>\n",
       "      <td>0.778024</td>\n",
       "      <td>0.751603</td>\n",
       "      <td>0.860225</td>\n",
       "      <td>0.919365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Robert Langer</th>\n",
       "      <td>0.907839</td>\n",
       "      <td>0.859964</td>\n",
       "      <td>0.895532</td>\n",
       "      <td>0.849876</td>\n",
       "      <td>0.781578</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Marvin Minsky</th>\n",
       "      <td>0.323577</td>\n",
       "      <td>0.151996</td>\n",
       "      <td>0.194030</td>\n",
       "      <td>0.118541</td>\n",
       "      <td>0.098935</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                pct_collab_linauth_%  pct_collab_linprof_%  \\\n",
       "name                                                         \n",
       "Eric S. Lander              0.611609              0.778024   \n",
       "Robert Langer               0.907839              0.859964   \n",
       "Marvin Minsky               0.323577              0.151996   \n",
       "\n",
       "                pct_collab_sqrtauth_%  pct_collab_sqrtprof_%  \\\n",
       "name                                                           \n",
       "Eric S. Lander               0.751603               0.860225   \n",
       "Robert Langer                0.895532               0.849876   \n",
       "Marvin Minsky                0.194030               0.118541   \n",
       "\n",
       "                pct_collab_unweighted_%  \n",
       "name                                     \n",
       "Eric S. Lander                 0.919365  \n",
       "Robert Langer                  0.781578  \n",
       "Marvin Minsky                  0.098935  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_percentile = df_pct_collaborative_pubs.copy()\n",
    "for col in df_pct_collaborative_pubs.columns:\n",
    "    percentile_col = df_pct_collaborative_pubs[pd.notna(df_pct_collaborative_pubs[col])][col]\n",
    "    df_percentile[col+'_%'] = percentile_col.rank(pct=True)\n",
    "df_percentile.loc[['Eric S. Lander', 'Robert Langer', 'Marvin Minsky']][[col for col in df_percentile.columns if '%' in col]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
