{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "import pandas as pd\n",
    "from py2neo import Graph, Node, Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_to_df(query, graph):\n",
    "    print(\"Starting query...\", end=\" \")\n",
    "    query_start_time = time.time()\n",
    "    df = graph.run(query).to_data_frame()\n",
    "    print(\"Done ({:.2f} minutes).\".format((time.time()-query_start_time)/60))\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to graph database with 278,432,359 nodes and 1,844,501,832 relationships!\n"
     ]
    }
   ],
   "source": [
    "graph = Graph( \"bolt://matlaber5.media.mit.edu:7687\", auth=('neo4j','myneo'))\n",
    "print(\"Connected to graph database with {:,} nodes and {:,} relationships!\".format(\n",
    "    graph.database.primitive_counts['NumberOfNodeIdsInUse'], \n",
    "    graph.database.primitive_counts['NumberOfRelationshipIdsInUse']))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "top_5 = ['Cell', 'Nature', 'Nature Biotechnology','Proceedings of the National Academy of Sciences of the United States of America','Science']\n",
    "top_10 = ['Cell', 'Nature', 'Nature Biotechnology','Proceedings of the National Academy of Sciences of the United States of America','Science', 'Journal of the American Chemical Society', 'JAMA', 'The New England Journal of Medicine', 'Nature Genetics', 'Neuron']\n",
    "top_42 = ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "df_impact_rank = pd.read_csv('~/Workspace/UROP/scaling-science/notebooks/Collaboration/Data/impact_rank.csv',encoding = \"UTF-8\")\n",
    "top_profs = set()\n",
    "for prof in df_impact_rank['avg_PR']:\n",
    "    top_profs.add(prof)\n",
    "for prof in df_impact_rank['avg_AR']:\n",
    "    top_profs.add(prof)\n",
    "top_profs = list(top_profs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['David P. Bartel',\n",
       " 'Amos Tversky',\n",
       " 'Joseph L. Fleiss',\n",
       " 'Martin Ringwald',\n",
       " 'Jacques Ferlay',\n",
       " 'William T. Friedewald',\n",
       " 'Marshal F. Folstein',\n",
       " 'B. G. Barrell',\n",
       " 'Kevin McKernan',\n",
       " 'Desmond G. Higgins',\n",
       " 'Qui-Lim Choo',\n",
       " 'Rajinder Kaul',\n",
       " 'David R. Bentley',\n",
       " 'Katherine M. Flegal',\n",
       " 'Paul Predki',\n",
       " 'LaDeana W. Hillier',\n",
       " 'Tim R. Mosmann',\n",
       " 'Stephen F. Altschul',\n",
       " 'Randall K. Saiki',\n",
       " 'J. Gillis',\n",
       " 'P Park',\n",
       " 'Edwin M. Southern',\n",
       " 'David G. Lowe',\n",
       " 'Webb Miller',\n",
       " 'Richard R. Copley',\n",
       " 'N. Ferrara',\n",
       " 'I. M. Stratton',\n",
       " 'Sidney P. Colowick',\n",
       " 'Eli Robins',\n",
       " 'Christie Kovar',\n",
       " 'Susan M. Hailpern',\n",
       " 'F. Sanger',\n",
       " 'Ian Korf',\n",
       " 'J. Michael Cherry',\n",
       " 'A. L. Hodgkin',\n",
       " 'Ronald L. Rivest',\n",
       " 'Nathan Mantel',\n",
       " 'Lee N. Robins',\n",
       " 'Patrick Minx',\n",
       " 'William H. Stein',\n",
       " 'Daniel Kahneman',\n",
       " 'Eric Pelletier',\n",
       " 'Richard Peto',\n",
       " 'Richard M. Karp',\n",
       " 'Saul A. Teukolsky',\n",
       " 'B. A. Roe',\n",
       " 'Chad Nusbaum',\n",
       " 'Richard Helm',\n",
       " 'John R. Carson',\n",
       " 'Daniel C. Koboldt',\n",
       " 'Aaron L. Halpern',\n",
       " 'Georges Köhler',\n",
       " 'Elizabeth Lacy',\n",
       " 'Lars Hedin',\n",
       " 'Masatoshi Nei',\n",
       " 'Robert C. Onofrio',\n",
       " 'Cynthia L. Ogden',\n",
       " 'Andrew Kasarskis',\n",
       " 'Stephen T. Sherry',\n",
       " 'Yoav Freund',\n",
       " 'Zoltán N. Oltvai',\n",
       " 'Scott Shenker',\n",
       " 'N. E. Day',\n",
       " 'Donald B. Rubin',\n",
       " 'David L. Donoho',\n",
       " 'W. James Kent',\n",
       " 'Mark Dickson',\n",
       " 'David J. Lipman',\n",
       " 'John G. Kirkwood',\n",
       " 'Carole A. Cull',\n",
       " 'Robert Baertsch',\n",
       " 'J. J. Hopfield',\n",
       " 'David R. Cox',\n",
       " 'Victor R. Ambros',\n",
       " 'Michael S. Gottlieb',\n",
       " 'Deanna M. Church',\n",
       " 'Raymond J. MacDonald',\n",
       " 'Thomas D. Schmittgen',\n",
       " 'Anne S. Olsen',\n",
       " 'Sergey V. Morozov',\n",
       " 'D. R. Matthews',\n",
       " 'Arthur L. Delcher',\n",
       " 'Stanford Moore',\n",
       " 'Donald R. Huffman',\n",
       " 'Sean Humphray',\n",
       " 'Koichiro Tamura',\n",
       " 'Geoffrey E. Hinton',\n",
       " 'Michael L. Watson',\n",
       " 'Jennifer Baldwin',\n",
       " 'Wayne J. Higgins',\n",
       " 'C Redmond',\n",
       " 'Timothy Fennell',\n",
       " 'Louis A. Tartaglia',\n",
       " 'M. D. Poulik',\n",
       " 'J Martin Bland',\n",
       " 'Edward J. Roccella',\n",
       " 'Scott M. Hammond',\n",
       " 'James B. Hicks',\n",
       " 'Aileen Robertson',\n",
       " 'Cole Trapnell',\n",
       " 'Parnesh Raniga',\n",
       " 'Leon Festinger',\n",
       " 'Anthony R. Kerlavage',\n",
       " 'Liesi E. Hebert',\n",
       " 'James I. Cleeman',\n",
       " 'Margherita Maffei',\n",
       " 'William Haenszel',\n",
       " 'Theophil Staehelin',\n",
       " 'Tavia Gordon',\n",
       " 'Mary Burden',\n",
       " 'Isaac L. Chuang',\n",
       " 'Paul Milgrom',\n",
       " 'Michael C. Zody',\n",
       " 'Lora Lewis',\n",
       " 'Martin Gibson',\n",
       " 'W. M. Cowan',\n",
       " 'J Holmes',\n",
       " 'Sidney J. Cutler',\n",
       " 'Aravind Subramanian',\n",
       " 'Marilyn Bergner',\n",
       " 'Ulrich K. Laemmli',\n",
       " 'Terrence S. Furey',\n",
       " 'Oliver H. Lowry',\n",
       " 'Parkhurst A. Shore',\n",
       " 'Jeffrey Vieira',\n",
       " 'Harry Towbin',\n",
       " 'Paul Meier',\n",
       " 'Jeremy H. Burroughes',\n",
       " 'Amy E. Pasquinelli',\n",
       " 'Lee Rowen',\n",
       " 'Ellen E. Walters',\n",
       " 'Michael B. Eisen',\n",
       " 'Dienstag Jl',\n",
       " 'Margaret D. Carroll',\n",
       " 'R. A. Fisher',\n",
       " 'Martin Poenie',\n",
       " 'Helga Boedtker',\n",
       " 'David L. Swofford',\n",
       " 'Gordon J',\n",
       " 'Alan Coulson',\n",
       " 'Pamela Whittaker',\n",
       " 'Joseph Sambrook',\n",
       " 'John P. Huelsenbeck',\n",
       " 'Granger G. Sutton',\n",
       " 'Josep F. Abril',\n",
       " 'Eric S. Lander',\n",
       " 'Pui Yan Kwok',\n",
       " 'Eugene W. Myers',\n",
       " 'F. C. Greenwood',\n",
       " 'John E. Ware',\n",
       " 'Jill P. Mesirov',\n",
       " 'David W. Hosmer',\n",
       " 'Arian Smit',\n",
       " 'Vishwanath R. Iyer',\n",
       " 'Richard R. Hudson',\n",
       " 'al. et',\n",
       " 'Kenneth J. Livak',\n",
       " 'Michaele C. Christian',\n",
       " 'Michael L. Metzker',\n",
       " 'Toby J. Gibson',\n",
       " 'Rebecca DerSimonian',\n",
       " 'William P. Castelli',\n",
       " 'Karen A. Ketchum',\n",
       " 'Nan M. Laird',\n",
       " 'Thomas R. Dawber',\n",
       " 'Julie D. Thompson',\n",
       " 'Robert L. Spitzer',\n",
       " 'A. F. Huxley',\n",
       " 'Peter W. J. Rigby',\n",
       " 'Tom Maniatis',\n",
       " 'W. Brian Arthur',\n",
       " 'Tobias Doerks',\n",
       " 'Joseph O. Hirschfelder',\n",
       " 'Ivica Letunic',\n",
       " 'Richard D. Piner',\n",
       " 'Robert Tibshirani',\n",
       " 'Gabor T. Marth',\n",
       " 'Gavin Sherlock',\n",
       " 'Catherine A. Ball',\n",
       " 'H. R. Horvitz',\n",
       " 'Jane Rogers',\n",
       " 'Erica Sodergren',\n",
       " 'Alan J. Buckler',\n",
       " 'Patrick O. Brown',\n",
       " 'Felsenfeld Al',\n",
       " 'Sean R. Eddy',\n",
       " 'Robert J. Dodson',\n",
       " 'Kary B. Mullis',\n",
       " 'Russell Higuchi',\n",
       " 'Jane G. Schaller',\n",
       " 'David Botstein',\n",
       " 'Jonathan Marchini',\n",
       " 'Todd M. Lowe',\n",
       " 'David S. Johnson',\n",
       " 'Michael R. Hee',\n",
       " 'Mark T. Ross',\n",
       " 'Clifford L. Johnson',\n",
       " 'Toby Bloom',\n",
       " 'D. R. Cox',\n",
       " 'Lucinda Fulton',\n",
       " 'G. E. Palade',\n",
       " 'W. Dansgaard',\n",
       " 'Christopher B. Burge',\n",
       " 'Torsten N. Wiesel',\n",
       " 'Susan E. Folstein',\n",
       " 'Renaud Capdeville',\n",
       " 'Ingrid Daubechies',\n",
       " 'Steven E. Scherer',\n",
       " 'C. Milstein',\n",
       " 'F. Barre-Sinoussi',\n",
       " 'David J. Dooling',\n",
       " 'Nicoletta Sacchi',\n",
       " 'Mark S. Guyer',\n",
       " 'Kara Dolinski',\n",
       " 'V. S. Kalyanaraman',\n",
       " 'Suzanna E. Lewis',\n",
       " 'Robert B. Catalano',\n",
       " 'Tarjei S. Mikkelsen',\n",
       " 'Ronald A. Laskey',\n",
       " 'Tetsuo Maita',\n",
       " 'Carl-Magnus Rudenstam',\n",
       " 'Jeffrey C. Lee',\n",
       " 'Brufman G',\n",
       " 'Fred Ederer',\n",
       " 'Allen Newell',\n",
       " 'R W Davis',\n",
       " 'Folke Skoog',\n",
       " 'E. Kellenberger',\n",
       " 'Stephen J. Aldington',\n",
       " 'Michael C. Wendl',\n",
       " 'David A. Hungerford',\n",
       " 'Nj Bell',\n",
       " 'Teresa C. Horan',\n",
       " 'Nicholas B. Lydon',\n",
       " 'Richard H. Creech',\n",
       " 'Trevor Hawkins',\n",
       " 'Jane Peterson',\n",
       " 'Jeremy Peterson',\n",
       " 'John E. Helzer',\n",
       " 'Ghia Euskirchen',\n",
       " 'John H. Holland',\n",
       " 'Richard Durbin',\n",
       " 'Marjorie B. Lees',\n",
       " 'P. Armitage']"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "['David P. Bartel',  'Amos Tversky',  'Joseph L. Fleiss',  'Martin Ringwald',  'Jacques Ferlay',  'William T. Friedewald',  'Marshal F. Folstein',  'B. G. Barrell',  'Kevin McKernan',  'Desmond G. Higgins',  'Qui-Lim Choo',  'Rajinder Kaul',  'David R. Bentley',  'Katherine M. Flegal',  'Paul Predki',  'LaDeana W. Hillier',  'Tim R. Mosmann',  'Stephen F. Altschul',  'Randall K. Saiki',  'J. Gillis',  'P Park',  'Edwin M. Southern',  'David G. Lowe',  'Webb Miller',  'Richard R. Copley',  'N. Ferrara',  'I. M. Stratton',  'Sidney P. Colowick',  'Eli Robins',  'Christie Kovar',  'Susan M. Hailpern',  'F. Sanger',  'Ian Korf',  'J. Michael Cherry',  'A. L. Hodgkin',  'Ronald L. Rivest',  'Nathan Mantel',  'Lee N. Robins',  'Patrick Minx',  'William H. Stein',  'Daniel Kahneman',  'Eric Pelletier',  'Richard Peto',  'Richard M. Karp',  'Saul A. Teukolsky',  'B. A. Roe',  'Chad Nusbaum',  'Richard Helm',  'John R. Carson',  'Daniel C. Koboldt',  'Aaron L. Halpern',  'Georges Köhler',  'Elizabeth Lacy',  'Lars Hedin',  'Masatoshi Nei',  'Robert C. Onofrio',  'Cynthia L. Ogden',  'Andrew Kasarskis',   'Stephen T. Sherry',  'Yoav Freund',  'Zoltán N. Oltvai',  'Scott Shenker',  'N. E. Day',  'Donald B. Rubin',  'David L. Donoho',  'W. James Kent',  'Mark Dickson',  'David J. Lipman',  'John G. Kirkwood',  'Carole A. Cull',  'Robert Baertsch',  'J. J. Hopfield',  'David R. Cox',  'Victor R. Ambros',  'Michael S. Gottlieb',  'Deanna M. Church',  'Raymond J. MacDonald',  'Thomas D. Schmittgen',  'Anne S. Olsen',  'Sergey V. Morozov',  'D. R. Matthews',  'Arthur L. Delcher',  'Stanford Moore',  'Donald R. Huffman',  'Sean Humphray',  'Koichiro Tamura',  'Geoffrey E. Hinton',  'Michael L. Watson',  'Jennifer Baldwin',  'Wayne J. Higgins',  'C Redmond',  'Timothy Fennell',  'Louis A. Tartaglia',  'M. D. Poulik',  'J Martin Bland',  'Edward J. Roccella',  'Scott M. Hammond',  'James B. Hicks',  'Aileen Robertson',  'Cole Trapnell',  'Parnesh Raniga',  'Leon Festinger',  'Anthony R. Kerlavage',  'Liesi E. Hebert',  'James I. Cleeman',  'Margherita Maffei',  'William Haenszel',  'Theophil Staehelin',  'Tavia Gordon',  'Mary Burden',  'Isaac L. Chuang',  'Paul Milgrom',  'Michael C. Zody',  'Lora Lewis',  'Martin Gibson',  'W. M. Cowan',  'J Holmes',  'Sidney J. Cutler',  'Aravind Subramanian',  'Marilyn Bergner',  'Ulrich K. Laemmli',  'Terrence S. Furey',  'Oliver H. Lowry',  'Parkhurst A. Shore',  'Jeffrey Vieira',  'Harry Towbin',  'Paul Meier',  'Jeremy H. Burroughes',  'Amy E. Pasquinelli',  'Lee Rowen',  'Ellen E. Walters',  'Michael B. Eisen',  'Dienstag Jl',  'Margaret D. Carroll',  'R. A. Fisher',  'Martin Poenie',  'Helga Boedtker',  'David L. Swofford',  'Gordon J',  'Alan Coulson',  'Pamela Whittaker',  'Joseph Sambrook',  'John P. Huelsenbeck',  'Granger G. Sutton',  'Josep F. Abril',  'Eric S. Lander',  'Pui Yan Kwok',  'Eugene W. Myers',  'F. C. Greenwood',  'John E. Ware',  'Jill P. Mesirov',  'David W. Hosmer',  'Arian Smit',  'Vishwanath R. Iyer',  'Richard R. Hudson',  'al. et',  'Kenneth J. Livak',  'Michaele C. Christian',  'Michael L. Metzker', 'Toby J. Gibson',  'Rebecca DerSimonian',  'William P. Castelli',  'Karen A. Ketchum',  'Nan M. Laird',  'Thomas R. Dawber',  'Julie D. Thompson',  'Robert L. Spitzer',  'A. F. Huxley',  'Peter W. J. Rigby',  'Tom Maniatis',  'W. Brian Arthur',  'Tobias Doerks',  'Joseph O. Hirschfelder',  'Ivica Letunic',  'Richard D. Piner',  'Robert Tibshirani',  'Gabor T. Marth',  'Gavin Sherlock',  'Catherine A. Ball',  'H. R. Horvitz',  'Jane Rogers',  'Erica Sodergren',  'Alan J. Buckler',  'Patrick O. Brown',  'Felsenfeld Al',  'Sean R. Eddy',  'Robert J. Dodson',  'Kary B. Mullis',  'Russell Higuchi',  'Jane G. Schaller',  'David Botstein',  'Jonathan Marchini',  'Todd M. Lowe',  'David S. Johnson',  'Michael R. Hee',  'Mark T. Ross',  'Clifford L. Johnson',  'Toby Bloom',  'D. R. Cox',  'Lucinda Fulton',  'G. E. Palade',  'W. Dansgaard',  'Christopher B. Burge',  'Torsten N. Wiesel',  'Susan E. Folstein',  'Renaud Capdeville',  'Ingrid Daubechies',  'Steven E. Scherer',  'C. Milstein',  'F. Barre-Sinoussi',  'David J. Dooling',  'Nicoletta Sacchi',  'Mark S. Guyer',  'Kara Dolinski',  'V. S. Kalyanaraman',  'Suzanna E. Lewis',  'Robert B. Catalano',  'Tarjei S. Mikkelsen',  'Ronald A. Laskey',  'Tetsuo Maita',  'Carl-Magnus Rudenstam',  'Jeffrey C. Lee',  'Brufman G',  'Fred Ederer',  'Allen Newell',  'R W Davis',  'Folke Skoog',  'E. Kellenberger',  'Stephen J. Aldington',  'Michael C. Wendl',  'David A. Hungerford',  'Nj Bell',  'Teresa C. Horan',  'Nicholas B. Lydon',  'Richard H. Creech',  'Trevor Hawkins',  'Jane Peterson',  'Jeremy Peterson',  'John E. Helzer',  'Ghia Euskirchen',  'John H. Holland',  'Richard Durbin',  'Marjorie B. Lees',  'P. Armitage']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.03 minutes).\n"
     ]
    }
   ],
   "source": [
    "# Disruption\n",
    "query = \"\"\"\n",
    "call apoc.export.csv.query(\n",
    "\"MATCH (a:Top42Author)\n",
    "WHERE a.last_author_yr > 2013 \n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)<-[:AUTHORED]-(b:Author)\n",
    "WHERE q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "    AND q.year < a.last_author_yr\n",
    "    AND b.name in ['David P. Bartel',  'Amos Tversky',  'Joseph L. Fleiss',  'Martin Ringwald',  'Jacques Ferlay',  'William T. Friedewald',  'Marshal F. Folstein',  'B. G. Barrell',  'Kevin McKernan',  'Desmond G. Higgins',  'Qui-Lim Choo',  'Rajinder Kaul',  'David R. Bentley',  'Katherine M. Flegal',  'Paul Predki',  'LaDeana W. Hillier',  'Tim R. Mosmann',  'Stephen F. Altschul',  'Randall K. Saiki',  'J. Gillis',  'P Park',  'Edwin M. Southern',  'David G. Lowe',  'Webb Miller',  'Richard R. Copley',  'N. Ferrara',  'I. M. Stratton',  'Sidney P. Colowick',  'Eli Robins',  'Christie Kovar',  'Susan M. Hailpern',  'F. Sanger',  'Ian Korf',  'J. Michael Cherry',  'A. L. Hodgkin',  'Ronald L. Rivest',  'Nathan Mantel',  'Lee N. Robins',  'Patrick Minx',  'William H. Stein',  'Daniel Kahneman',  'Eric Pelletier',  'Richard Peto',  'Richard M. Karp',  'Saul A. Teukolsky',  'B. A. Roe',  'Chad Nusbaum',  'Richard Helm',  'John R. Carson',  'Daniel C. Koboldt',  'Aaron L. Halpern',  'Georges Köhler',  'Elizabeth Lacy',  'Lars Hedin',  'Masatoshi Nei',  'Robert C. Onofrio',  'Cynthia L. Ogden',  'Andrew Kasarskis',   'Stephen T. Sherry',  'Yoav Freund',  'Zoltán N. Oltvai',  'Scott Shenker',  'N. E. Day',  'Donald B. Rubin',  'David L. Donoho',  'W. James Kent',  'Mark Dickson',  'David J. Lipman',  'John G. Kirkwood',  'Carole A. Cull',  'Robert Baertsch',  'J. J. Hopfield',  'David R. Cox',  'Victor R. Ambros',  'Michael S. Gottlieb',  'Deanna M. Church',  'Raymond J. MacDonald',  'Thomas D. Schmittgen',  'Anne S. Olsen',  'Sergey V. Morozov',  'D. R. Matthews',  'Arthur L. Delcher',  'Stanford Moore',  'Donald R. Huffman',  'Sean Humphray',  'Koichiro Tamura',  'Geoffrey E. Hinton',  'Michael L. Watson',  'Jennifer Baldwin',  'Wayne J. Higgins',  'C Redmond',  'Timothy Fennell',  'Louis A. Tartaglia',  'M. D. Poulik',  'J Martin Bland',  'Edward J. Roccella',  'Scott M. Hammond',  'James B. Hicks',  'Aileen Robertson',  'Cole Trapnell',  'Parnesh Raniga',  'Leon Festinger',  'Anthony R. Kerlavage',  'Liesi E. Hebert',  'James I. Cleeman',  'Margherita Maffei',  'William Haenszel',  'Theophil Staehelin',  'Tavia Gordon',  'Mary Burden',  'Isaac L. Chuang',  'Paul Milgrom',  'Michael C. Zody',  'Lora Lewis',  'Martin Gibson',  'W. M. Cowan',  'J Holmes',  'Sidney J. Cutler',  'Aravind Subramanian',  'Marilyn Bergner',  'Ulrich K. Laemmli',  'Terrence S. Furey',  'Oliver H. Lowry',  'Parkhurst A. Shore',  'Jeffrey Vieira',  'Harry Towbin',  'Paul Meier',  'Jeremy H. Burroughes',  'Amy E. Pasquinelli',  'Lee Rowen',  'Ellen E. Walters',  'Michael B. Eisen',  'Dienstag Jl',  'Margaret D. Carroll',  'R. A. Fisher',  'Martin Poenie',  'Helga Boedtker',  'David L. Swofford',  'Gordon J',  'Alan Coulson',  'Pamela Whittaker',  'Joseph Sambrook',  'John P. Huelsenbeck',  'Granger G. Sutton',  'Josep F. Abril',  'Eric S. Lander',  'Pui Yan Kwok',  'Eugene W. Myers',  'F. C. Greenwood',  'John E. Ware',  'Jill P. Mesirov',  'David W. Hosmer',  'Arian Smit',  'Vishwanath R. Iyer',  'Richard R. Hudson',  'al. et',  'Kenneth J. Livak',  'Michaele C. Christian',  'Michael L. Metzker', 'Toby J. Gibson',  'Rebecca DerSimonian',  'William P. Castelli',  'Karen A. Ketchum',  'Nan M. Laird',  'Thomas R. Dawber',  'Julie D. Thompson',  'Robert L. Spitzer',  'A. F. Huxley',  'Peter W. J. Rigby',  'Tom Maniatis',  'W. Brian Arthur',  'Tobias Doerks',  'Joseph O. Hirschfelder',  'Ivica Letunic',  'Richard D. Piner',  'Robert Tibshirani',  'Gabor T. Marth',  'Gavin Sherlock',  'Catherine A. Ball',  'H. R. Horvitz',  'Jane Rogers',  'Erica Sodergren',  'Alan J. Buckler',  'Patrick O. Brown',  'Felsenfeld Al',  'Sean R. Eddy',  'Robert J. Dodson',  'Kary B. Mullis',  'Russell Higuchi',  'Jane G. Schaller',  'David Botstein',  'Jonathan Marchini',  'Todd M. Lowe',  'David S. Johnson',  'Michael R. Hee',  'Mark T. Ross',  'Clifford L. Johnson',  'Toby Bloom',  'D. R. Cox',  'Lucinda Fulton',  'G. E. Palade',  'W. Dansgaard',  'Christopher B. Burge',  'Torsten N. Wiesel',  'Susan E. Folstein',  'Renaud Capdeville',  'Ingrid Daubechies',  'Steven E. Scherer',  'C. Milstein',  'F. Barre-Sinoussi',  'David J. Dooling',  'Nicoletta Sacchi',  'Mark S. Guyer',  'Kara Dolinski',  'V. S. Kalyanaraman',  'Suzanna E. Lewis',  'Robert B. Catalano',  'Tarjei S. Mikkelsen',  'Ronald A. Laskey',  'Tetsuo Maita',  'Carl-Magnus Rudenstam',  'Jeffrey C. Lee',  'Brufman G',  'Fred Ederer',  'Allen Newell',  'R W Davis',  'Folke Skoog',  'E. Kellenberger',  'Stephen J. Aldington',  'Michael C. Wendl',  'David A. Hungerford',  'Nj Bell',  'Teresa C. Horan',  'Nicholas B. Lydon',  'Richard H. Creech',  'Trevor Hawkins',  'Jane Peterson',  'Jeremy Peterson',  'John E. Helzer',  'Ghia Euskirchen',  'John H. Holland',  'Richard Durbin',  'Marjorie B. Lees',  'P. Armitage']\n",
    "\n",
    "WITH a, COUNT(q) AS num_top_collabs\n",
    "WHERE num_top_collabs > 0\n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "     AND exists(q.Disruption) AND a.last_author_yr <= q.year \n",
    "WITH a, COUNT(q) AS num_disrupt, SUM(q.Disruption) AS tot_disrupt, MIN(q.Disruption) AS min_disrupt, MAX(q.Disruption) AS max_disrupt, percentileCont(q.Disruption, 0.5) AS median_disrupt \n",
    "RETURN a.last_author_yr AS last_author_yr, \n",
    "    a.name AS name, \n",
    "    num_disrupt, \n",
    "    toFloat(tot_disrupt)/num_disrupt AS avg_disrupt, \n",
    "    min_disrupt, \n",
    "    max_disrupt, \n",
    "    median_disrupt\"\n",
    ", \"/data/csv/Disrupt_Early_Profs_2.csv\", {batchSize:100, iterateList:true, parallel:true})\n",
    "\"\"\"\n",
    "df_disruption = query_to_df(query, graph)\n",
    "# df_disruption.to_csv('~/Workspace/UROP/scaling-science/notebooks/Collaboration/Data/Disrupt_Early_Profs.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.05 minutes).\n"
     ]
    }
   ],
   "source": [
    "# Collaboration\n",
    "avg_degree = 11.327052\n",
    "query = \"\"\"\n",
    "call apoc.export.csv.query(\n",
    "\"MATCH (a:Top42Author)\n",
    "WHERE a.last_author_yr > 2013 \n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)<-[:AUTHORED]-(b:Author)\n",
    "WHERE q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "    AND q.year < a.last_author_yr\n",
    "    AND b.name in ['David P. Bartel',  'Amos Tversky',  'Joseph L. Fleiss',  'Martin Ringwald',  'Jacques Ferlay',  'William T. Friedewald',  'Marshal F. Folstein',  'B. G. Barrell',  'Kevin McKernan',  'Desmond G. Higgins',  'Qui-Lim Choo',  'Rajinder Kaul',  'David R. Bentley',  'Katherine M. Flegal',  'Paul Predki',  'LaDeana W. Hillier',  'Tim R. Mosmann',  'Stephen F. Altschul',  'Randall K. Saiki',  'J. Gillis',  'P Park',  'Edwin M. Southern',  'David G. Lowe',  'Webb Miller',  'Richard R. Copley',  'N. Ferrara',  'I. M. Stratton',  'Sidney P. Colowick',  'Eli Robins',  'Christie Kovar',  'Susan M. Hailpern',  'F. Sanger',  'Ian Korf',  'J. Michael Cherry',  'A. L. Hodgkin',  'Ronald L. Rivest',  'Nathan Mantel',  'Lee N. Robins',  'Patrick Minx',  'William H. Stein',  'Daniel Kahneman',  'Eric Pelletier',  'Richard Peto',  'Richard M. Karp',  'Saul A. Teukolsky',  'B. A. Roe',  'Chad Nusbaum',  'Richard Helm',  'John R. Carson',  'Daniel C. Koboldt',  'Aaron L. Halpern',  'Georges Köhler',  'Elizabeth Lacy',  'Lars Hedin',  'Masatoshi Nei',  'Robert C. Onofrio',  'Cynthia L. Ogden',  'Andrew Kasarskis',   'Stephen T. Sherry',  'Yoav Freund',  'Zoltán N. Oltvai',  'Scott Shenker',  'N. E. Day',  'Donald B. Rubin',  'David L. Donoho',  'W. James Kent',  'Mark Dickson',  'David J. Lipman',  'John G. Kirkwood',  'Carole A. Cull',  'Robert Baertsch',  'J. J. Hopfield',  'David R. Cox',  'Victor R. Ambros',  'Michael S. Gottlieb',  'Deanna M. Church',  'Raymond J. MacDonald',  'Thomas D. Schmittgen',  'Anne S. Olsen',  'Sergey V. Morozov',  'D. R. Matthews',  'Arthur L. Delcher',  'Stanford Moore',  'Donald R. Huffman',  'Sean Humphray',  'Koichiro Tamura',  'Geoffrey E. Hinton',  'Michael L. Watson',  'Jennifer Baldwin',  'Wayne J. Higgins',  'C Redmond',  'Timothy Fennell',  'Louis A. Tartaglia',  'M. D. Poulik',  'J Martin Bland',  'Edward J. Roccella',  'Scott M. Hammond',  'James B. Hicks',  'Aileen Robertson',  'Cole Trapnell',  'Parnesh Raniga',  'Leon Festinger',  'Anthony R. Kerlavage',  'Liesi E. Hebert',  'James I. Cleeman',  'Margherita Maffei',  'William Haenszel',  'Theophil Staehelin',  'Tavia Gordon',  'Mary Burden',  'Isaac L. Chuang',  'Paul Milgrom',  'Michael C. Zody',  'Lora Lewis',  'Martin Gibson',  'W. M. Cowan',  'J Holmes',  'Sidney J. Cutler',  'Aravind Subramanian',  'Marilyn Bergner',  'Ulrich K. Laemmli',  'Terrence S. Furey',  'Oliver H. Lowry',  'Parkhurst A. Shore',  'Jeffrey Vieira',  'Harry Towbin',  'Paul Meier',  'Jeremy H. Burroughes',  'Amy E. Pasquinelli',  'Lee Rowen',  'Ellen E. Walters',  'Michael B. Eisen',  'Dienstag Jl',  'Margaret D. Carroll',  'R. A. Fisher',  'Martin Poenie',  'Helga Boedtker',  'David L. Swofford',  'Gordon J',  'Alan Coulson',  'Pamela Whittaker',  'Joseph Sambrook',  'John P. Huelsenbeck',  'Granger G. Sutton',  'Josep F. Abril',  'Eric S. Lander',  'Pui Yan Kwok',  'Eugene W. Myers',  'F. C. Greenwood',  'John E. Ware',  'Jill P. Mesirov',  'David W. Hosmer',  'Arian Smit',  'Vishwanath R. Iyer',  'Richard R. Hudson',  'al. et',  'Kenneth J. Livak',  'Michaele C. Christian',  'Michael L. Metzker', 'Toby J. Gibson',  'Rebecca DerSimonian',  'William P. Castelli',  'Karen A. Ketchum',  'Nan M. Laird',  'Thomas R. Dawber',  'Julie D. Thompson',  'Robert L. Spitzer',  'A. F. Huxley',  'Peter W. J. Rigby',  'Tom Maniatis',  'W. Brian Arthur',  'Tobias Doerks',  'Joseph O. Hirschfelder',  'Ivica Letunic',  'Richard D. Piner',  'Robert Tibshirani',  'Gabor T. Marth',  'Gavin Sherlock',  'Catherine A. Ball',  'H. R. Horvitz',  'Jane Rogers',  'Erica Sodergren',  'Alan J. Buckler',  'Patrick O. Brown',  'Felsenfeld Al',  'Sean R. Eddy',  'Robert J. Dodson',  'Kary B. Mullis',  'Russell Higuchi',  'Jane G. Schaller',  'David Botstein',  'Jonathan Marchini',  'Todd M. Lowe',  'David S. Johnson',  'Michael R. Hee',  'Mark T. Ross',  'Clifford L. Johnson',  'Toby Bloom',  'D. R. Cox',  'Lucinda Fulton',  'G. E. Palade',  'W. Dansgaard',  'Christopher B. Burge',  'Torsten N. Wiesel',  'Susan E. Folstein',  'Renaud Capdeville',  'Ingrid Daubechies',  'Steven E. Scherer',  'C. Milstein',  'F. Barre-Sinoussi',  'David J. Dooling',  'Nicoletta Sacchi',  'Mark S. Guyer',  'Kara Dolinski',  'V. S. Kalyanaraman',  'Suzanna E. Lewis',  'Robert B. Catalano',  'Tarjei S. Mikkelsen',  'Ronald A. Laskey',  'Tetsuo Maita',  'Carl-Magnus Rudenstam',  'Jeffrey C. Lee',  'Brufman G',  'Fred Ederer',  'Allen Newell',  'R W Davis',  'Folke Skoog',  'E. Kellenberger',  'Stephen J. Aldington',  'Michael C. Wendl',  'David A. Hungerford',  'Nj Bell',  'Teresa C. Horan',  'Nicholas B. Lydon',  'Richard H. Creech',  'Trevor Hawkins',  'Jane Peterson',  'Jeremy Peterson',  'John E. Helzer',  'Ghia Euskirchen',  'John H. Holland',  'Richard Durbin',  'Marjorie B. Lees',  'P. Armitage']\n",
    "\n",
    "WITH a, COUNT(q) AS num_top_collabs\n",
    "WHERE num_top_collabs > 0\n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)<-[:AUTHORED]-(b:Top42Author)\n",
    "    WHERE q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "         AND a.last_author_yr <= q.year AND b.last_author_yr <= q.year  \n",
    "    WITH a, b, \n",
    "        (toFloat(1) / (11.327052 + avg(q.num_profs_v2))) as u_lin,\n",
    "        (toFloat(1) / sqrt(11.327052 + avg(q.num_profs_v2))) as u_sqrt,\n",
    "        (toFloat(1) / (11.327052 + avg(q.num_profs_v2))^2) as u_square,\n",
    "        (toFloat(1) / exp(11.327052 + avg(q.num_profs_v2))) as u_exp\n",
    "        \n",
    "    RETURN a.name as name, \n",
    "        a.last_author_yr as last_author_yr,\n",
    "        count(u_lin) as unique_coauthor_profs, \n",
    "        11.327052*sum(u_lin) as unique_coauthor_profs_lin_damp,\n",
    "        sqrt(11.327052)*sum(u_sqrt) as unique_coauthor_profs_sqrt_damp,\n",
    "        11.327052^2*sum(u_square) as unique_coauthor_profs_square_damp,\n",
    "        exp(11.327052)*sum(u_exp) as unique_coauthor_profs_exp_damp\"\n",
    "        , \"/data/csv/Collab_Early_Profs_2.csv\", {batchSize:100, iterateList:true, parallel:true})\n",
    "    \"\"\"\n",
    "df_collab = query_to_df(query, graph)\n",
    "# df_collab.to_csv('~/Workspace/UROP/scaling-science/notebooks/Collaboration/Data/Collab_Early_Profs.csv', index = False, encoding = \"UTF-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (0.03 minutes).\n",
      "Starting query... Done (0.03 minutes).\n"
     ]
    }
   ],
   "source": [
    "# Impact\n",
    "query = \"\"\"\n",
    "call apoc.export.csv.query(\n",
    "\"MATCH (a:Top42Author)\n",
    "WHERE a.last_author_yr > 2013 \n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)<-[:AUTHORED]-(b:Author)\n",
    "WHERE q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "    AND q.year < a.last_author_yr\n",
    "    AND b.name in ['David P. Bartel',  'Amos Tversky',  'Joseph L. Fleiss',  'Martin Ringwald',  'Jacques Ferlay',  'William T. Friedewald',  'Marshal F. Folstein',  'B. G. Barrell',  'Kevin McKernan',  'Desmond G. Higgins',  'Qui-Lim Choo',  'Rajinder Kaul',  'David R. Bentley',  'Katherine M. Flegal',  'Paul Predki',  'LaDeana W. Hillier',  'Tim R. Mosmann',  'Stephen F. Altschul',  'Randall K. Saiki',  'J. Gillis',  'P Park',  'Edwin M. Southern',  'David G. Lowe',  'Webb Miller',  'Richard R. Copley',  'N. Ferrara',  'I. M. Stratton',  'Sidney P. Colowick',  'Eli Robins',  'Christie Kovar',  'Susan M. Hailpern',  'F. Sanger',  'Ian Korf',  'J. Michael Cherry',  'A. L. Hodgkin',  'Ronald L. Rivest',  'Nathan Mantel',  'Lee N. Robins',  'Patrick Minx',  'William H. Stein',  'Daniel Kahneman',  'Eric Pelletier',  'Richard Peto',  'Richard M. Karp',  'Saul A. Teukolsky',  'B. A. Roe',  'Chad Nusbaum',  'Richard Helm',  'John R. Carson',  'Daniel C. Koboldt',  'Aaron L. Halpern',  'Georges Köhler',  'Elizabeth Lacy',  'Lars Hedin',  'Masatoshi Nei',  'Robert C. Onofrio',  'Cynthia L. Ogden',  'Andrew Kasarskis',   'Stephen T. Sherry',  'Yoav Freund',  'Zoltán N. Oltvai',  'Scott Shenker',  'N. E. Day',  'Donald B. Rubin',  'David L. Donoho',  'W. James Kent',  'Mark Dickson',  'David J. Lipman',  'John G. Kirkwood',  'Carole A. Cull',  'Robert Baertsch',  'J. J. Hopfield',  'David R. Cox',  'Victor R. Ambros',  'Michael S. Gottlieb',  'Deanna M. Church',  'Raymond J. MacDonald',  'Thomas D. Schmittgen',  'Anne S. Olsen',  'Sergey V. Morozov',  'D. R. Matthews',  'Arthur L. Delcher',  'Stanford Moore',  'Donald R. Huffman',  'Sean Humphray',  'Koichiro Tamura',  'Geoffrey E. Hinton',  'Michael L. Watson',  'Jennifer Baldwin',  'Wayne J. Higgins',  'C Redmond',  'Timothy Fennell',  'Louis A. Tartaglia',  'M. D. Poulik',  'J Martin Bland',  'Edward J. Roccella',  'Scott M. Hammond',  'James B. Hicks',  'Aileen Robertson',  'Cole Trapnell',  'Parnesh Raniga',  'Leon Festinger',  'Anthony R. Kerlavage',  'Liesi E. Hebert',  'James I. Cleeman',  'Margherita Maffei',  'William Haenszel',  'Theophil Staehelin',  'Tavia Gordon',  'Mary Burden',  'Isaac L. Chuang',  'Paul Milgrom',  'Michael C. Zody',  'Lora Lewis',  'Martin Gibson',  'W. M. Cowan',  'J Holmes',  'Sidney J. Cutler',  'Aravind Subramanian',  'Marilyn Bergner',  'Ulrich K. Laemmli',  'Terrence S. Furey',  'Oliver H. Lowry',  'Parkhurst A. Shore',  'Jeffrey Vieira',  'Harry Towbin',  'Paul Meier',  'Jeremy H. Burroughes',  'Amy E. Pasquinelli',  'Lee Rowen',  'Ellen E. Walters',  'Michael B. Eisen',  'Dienstag Jl',  'Margaret D. Carroll',  'R. A. Fisher',  'Martin Poenie',  'Helga Boedtker',  'David L. Swofford',  'Gordon J',  'Alan Coulson',  'Pamela Whittaker',  'Joseph Sambrook',  'John P. Huelsenbeck',  'Granger G. Sutton',  'Josep F. Abril',  'Eric S. Lander',  'Pui Yan Kwok',  'Eugene W. Myers',  'F. C. Greenwood',  'John E. Ware',  'Jill P. Mesirov',  'David W. Hosmer',  'Arian Smit',  'Vishwanath R. Iyer',  'Richard R. Hudson',  'al. et',  'Kenneth J. Livak',  'Michaele C. Christian',  'Michael L. Metzker', 'Toby J. Gibson',  'Rebecca DerSimonian',  'William P. Castelli',  'Karen A. Ketchum',  'Nan M. Laird',  'Thomas R. Dawber',  'Julie D. Thompson',  'Robert L. Spitzer',  'A. F. Huxley',  'Peter W. J. Rigby',  'Tom Maniatis',  'W. Brian Arthur',  'Tobias Doerks',  'Joseph O. Hirschfelder',  'Ivica Letunic',  'Richard D. Piner',  'Robert Tibshirani',  'Gabor T. Marth',  'Gavin Sherlock',  'Catherine A. Ball',  'H. R. Horvitz',  'Jane Rogers',  'Erica Sodergren',  'Alan J. Buckler',  'Patrick O. Brown',  'Felsenfeld Al',  'Sean R. Eddy',  'Robert J. Dodson',  'Kary B. Mullis',  'Russell Higuchi',  'Jane G. Schaller',  'David Botstein',  'Jonathan Marchini',  'Todd M. Lowe',  'David S. Johnson',  'Michael R. Hee',  'Mark T. Ross',  'Clifford L. Johnson',  'Toby Bloom',  'D. R. Cox',  'Lucinda Fulton',  'G. E. Palade',  'W. Dansgaard',  'Christopher B. Burge',  'Torsten N. Wiesel',  'Susan E. Folstein',  'Renaud Capdeville',  'Ingrid Daubechies',  'Steven E. Scherer',  'C. Milstein',  'F. Barre-Sinoussi',  'David J. Dooling',  'Nicoletta Sacchi',  'Mark S. Guyer',  'Kara Dolinski',  'V. S. Kalyanaraman',  'Suzanna E. Lewis',  'Robert B. Catalano',  'Tarjei S. Mikkelsen',  'Ronald A. Laskey',  'Tetsuo Maita',  'Carl-Magnus Rudenstam',  'Jeffrey C. Lee',  'Brufman G',  'Fred Ederer',  'Allen Newell',  'R W Davis',  'Folke Skoog',  'E. Kellenberger',  'Stephen J. Aldington',  'Michael C. Wendl',  'David A. Hungerford',  'Nj Bell',  'Teresa C. Horan',  'Nicholas B. Lydon',  'Richard H. Creech',  'Trevor Hawkins',  'Jane Peterson',  'Jeremy Peterson',  'John E. Helzer',  'Ghia Euskirchen',  'John H. Holland',  'Richard Durbin',  'Marjorie B. Lees',  'P. Armitage']\n",
    "WITH a, COUNT(q) AS num_top_collabs\n",
    "WHERE num_top_collabs > 0\n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE a.last_author_yr > 2013 AND q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "    AND a.last_author_yr <= q.year \n",
    "\n",
    "WITH a, COUNT(q) AS num_pubs, \n",
    "    SUM(q.pageRank_2018) AS tot_rank, \n",
    "    MIN(q.pageRank_2018) AS min_rank, \n",
    "    MAX(q.pageRank_2018) AS max_rank, \n",
    "    percentileCont(q.pageRank_2018, 0.5) AS median_rank \n",
    "\n",
    "RETURN a.name AS name, \n",
    "    toFloat(tot_rank)/num_pubs AS avg_PR, \n",
    "    min_rank AS min_PR, \n",
    "    max_rank AS max_PR, \n",
    "    median_rank AS median_PR\"\n",
    "    , \"/data/csv/PR_Early_Profs_2.csv\", {batchSize:100, iterateList:true, parallel:true})\n",
    "\n",
    "\"\"\"\n",
    "df_pr = query_to_df(query, graph)\n",
    "\n",
    "query = \"\"\"\n",
    "call apoc.export.csv.query(\n",
    "\"MATCH (a:Top42Author)\n",
    "WHERE a.last_author_yr > 2013 \n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)<-[:AUTHORED]-(b:Author)\n",
    "WHERE q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "    AND q.year < a.last_author_yr\n",
    "    AND b.name in ['David P. Bartel',  'Amos Tversky',  'Joseph L. Fleiss',  'Martin Ringwald',  'Jacques Ferlay',  'William T. Friedewald',  'Marshal F. Folstein',  'B. G. Barrell',  'Kevin McKernan',  'Desmond G. Higgins',  'Qui-Lim Choo',  'Rajinder Kaul',  'David R. Bentley',  'Katherine M. Flegal',  'Paul Predki',  'LaDeana W. Hillier',  'Tim R. Mosmann',  'Stephen F. Altschul',  'Randall K. Saiki',  'J. Gillis',  'P Park',  'Edwin M. Southern',  'David G. Lowe',  'Webb Miller',  'Richard R. Copley',  'N. Ferrara',  'I. M. Stratton',  'Sidney P. Colowick',  'Eli Robins',  'Christie Kovar',  'Susan M. Hailpern',  'F. Sanger',  'Ian Korf',  'J. Michael Cherry',  'A. L. Hodgkin',  'Ronald L. Rivest',  'Nathan Mantel',  'Lee N. Robins',  'Patrick Minx',  'William H. Stein',  'Daniel Kahneman',  'Eric Pelletier',  'Richard Peto',  'Richard M. Karp',  'Saul A. Teukolsky',  'B. A. Roe',  'Chad Nusbaum',  'Richard Helm',  'John R. Carson',  'Daniel C. Koboldt',  'Aaron L. Halpern',  'Georges Köhler',  'Elizabeth Lacy',  'Lars Hedin',  'Masatoshi Nei',  'Robert C. Onofrio',  'Cynthia L. Ogden',  'Andrew Kasarskis',   'Stephen T. Sherry',  'Yoav Freund',  'Zoltán N. Oltvai',  'Scott Shenker',  'N. E. Day',  'Donald B. Rubin',  'David L. Donoho',  'W. James Kent',  'Mark Dickson',  'David J. Lipman',  'John G. Kirkwood',  'Carole A. Cull',  'Robert Baertsch',  'J. J. Hopfield',  'David R. Cox',  'Victor R. Ambros',  'Michael S. Gottlieb',  'Deanna M. Church',  'Raymond J. MacDonald',  'Thomas D. Schmittgen',  'Anne S. Olsen',  'Sergey V. Morozov',  'D. R. Matthews',  'Arthur L. Delcher',  'Stanford Moore',  'Donald R. Huffman',  'Sean Humphray',  'Koichiro Tamura',  'Geoffrey E. Hinton',  'Michael L. Watson',  'Jennifer Baldwin',  'Wayne J. Higgins',  'C Redmond',  'Timothy Fennell',  'Louis A. Tartaglia',  'M. D. Poulik',  'J Martin Bland',  'Edward J. Roccella',  'Scott M. Hammond',  'James B. Hicks',  'Aileen Robertson',  'Cole Trapnell',  'Parnesh Raniga',  'Leon Festinger',  'Anthony R. Kerlavage',  'Liesi E. Hebert',  'James I. Cleeman',  'Margherita Maffei',  'William Haenszel',  'Theophil Staehelin',  'Tavia Gordon',  'Mary Burden',  'Isaac L. Chuang',  'Paul Milgrom',  'Michael C. Zody',  'Lora Lewis',  'Martin Gibson',  'W. M. Cowan',  'J Holmes',  'Sidney J. Cutler',  'Aravind Subramanian',  'Marilyn Bergner',  'Ulrich K. Laemmli',  'Terrence S. Furey',  'Oliver H. Lowry',  'Parkhurst A. Shore',  'Jeffrey Vieira',  'Harry Towbin',  'Paul Meier',  'Jeremy H. Burroughes',  'Amy E. Pasquinelli',  'Lee Rowen',  'Ellen E. Walters',  'Michael B. Eisen',  'Dienstag Jl',  'Margaret D. Carroll',  'R. A. Fisher',  'Martin Poenie',  'Helga Boedtker',  'David L. Swofford',  'Gordon J',  'Alan Coulson',  'Pamela Whittaker',  'Joseph Sambrook',  'John P. Huelsenbeck',  'Granger G. Sutton',  'Josep F. Abril',  'Eric S. Lander',  'Pui Yan Kwok',  'Eugene W. Myers',  'F. C. Greenwood',  'John E. Ware',  'Jill P. Mesirov',  'David W. Hosmer',  'Arian Smit',  'Vishwanath R. Iyer',  'Richard R. Hudson',  'al. et',  'Kenneth J. Livak',  'Michaele C. Christian',  'Michael L. Metzker', 'Toby J. Gibson',  'Rebecca DerSimonian',  'William P. Castelli',  'Karen A. Ketchum',  'Nan M. Laird',  'Thomas R. Dawber',  'Julie D. Thompson',  'Robert L. Spitzer',  'A. F. Huxley',  'Peter W. J. Rigby',  'Tom Maniatis',  'W. Brian Arthur',  'Tobias Doerks',  'Joseph O. Hirschfelder',  'Ivica Letunic',  'Richard D. Piner',  'Robert Tibshirani',  'Gabor T. Marth',  'Gavin Sherlock',  'Catherine A. Ball',  'H. R. Horvitz',  'Jane Rogers',  'Erica Sodergren',  'Alan J. Buckler',  'Patrick O. Brown',  'Felsenfeld Al',  'Sean R. Eddy',  'Robert J. Dodson',  'Kary B. Mullis',  'Russell Higuchi',  'Jane G. Schaller',  'David Botstein',  'Jonathan Marchini',  'Todd M. Lowe',  'David S. Johnson',  'Michael R. Hee',  'Mark T. Ross',  'Clifford L. Johnson',  'Toby Bloom',  'D. R. Cox',  'Lucinda Fulton',  'G. E. Palade',  'W. Dansgaard',  'Christopher B. Burge',  'Torsten N. Wiesel',  'Susan E. Folstein',  'Renaud Capdeville',  'Ingrid Daubechies',  'Steven E. Scherer',  'C. Milstein',  'F. Barre-Sinoussi',  'David J. Dooling',  'Nicoletta Sacchi',  'Mark S. Guyer',  'Kara Dolinski',  'V. S. Kalyanaraman',  'Suzanna E. Lewis',  'Robert B. Catalano',  'Tarjei S. Mikkelsen',  'Ronald A. Laskey',  'Tetsuo Maita',  'Carl-Magnus Rudenstam',  'Jeffrey C. Lee',  'Brufman G',  'Fred Ederer',  'Allen Newell',  'R W Davis',  'Folke Skoog',  'E. Kellenberger',  'Stephen J. Aldington',  'Michael C. Wendl',  'David A. Hungerford',  'Nj Bell',  'Teresa C. Horan',  'Nicholas B. Lydon',  'Richard H. Creech',  'Trevor Hawkins',  'Jane Peterson',  'Jeremy Peterson',  'John E. Helzer',  'Ghia Euskirchen',  'John H. Holland',  'Richard Durbin',  'Marjorie B. Lees',  'P. Armitage']\n",
    "WITH a, COUNT(q) AS num_top_collabs\n",
    "WHERE num_top_collabs > 0\n",
    "\n",
    "MATCH (a)-[:AUTHORED]->(q:Quanta)\n",
    "WHERE a.last_author_yr > 2013 AND q.venue in ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "    AND a.last_author_yr <= q.year \n",
    "\n",
    "WITH a, COUNT(q) AS num_pubs, \n",
    "    SUM(q.articleRank2018) AS tot_rank, \n",
    "    MIN(q.articleRank2018) AS min_rank, \n",
    "    MAX(q.articleRank2018) AS max_rank, \n",
    "    percentileCont(q.articleRank2018, 0.5) AS median_rank \n",
    "    \n",
    "RETURN a.name AS name, \n",
    "    toFloat(tot_rank)/num_pubs AS avg_AR, \n",
    "    min_rank AS min_AR, \n",
    "    max_rank AS max_AR, \n",
    "    median_rank AS median_AR\"\n",
    "    , \"/data/csv/AR_Early_Profs_2.csv\", {batchSize:100, iterateList:true, parallel:true})\n",
    "\n",
    "\"\"\"\n",
    "df_ar = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting query... Done (8.25 minutes).\n"
     ]
    }
   ],
   "source": [
    "# Num affiliations for each author\n",
    "query = \"\"\"\n",
    "call apoc.export.csv.query(\n",
    "\"MATCH (a:Top42Author)-[:AFFILIATED_WITH]->(o:Organization)\n",
    "RETURN a.name as name, COUNT(o) as orgs\",\n",
    "\"/data/csv/orgs.csv\", {batchSize:100, iterateList:true, parallel:true})\n",
    "\"\"\"\n",
    "df = query_to_df(query, graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "df_disrupt = pd.read_csv('~/scaling-science/data/magone/Disrupt_Early_Profs_2.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_collab = pd.read_csv('~/scaling-science/data/magone/Collab_Early_Profs_2.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_AR = pd.read_csv('~/scaling-science/data/magone/AR_Early_Profs_2.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_PR = pd.read_csv('~/scaling-science/data/magone/PR_Early_Profs_2.csv', index_col = 'name', encoding = \"UTF-8\")\n",
    "df_orgs = pd.read_csv('~/scaling-science/data/magone/orgs.csv', index_col = 'name', encoding = \"UTF-8\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def top_100_to_csv(trimmed_df, cols, name, to_csv = False):\n",
    "    d = dict()\n",
    "    for col in cols:\n",
    "        df_notna = trimmed_df[pd.notna(trimmed_df[col])]\n",
    "        sorted = df_notna[[col]].sort_values(col, ascending = False).head(50)\n",
    "        names = sorted.index.tolist()\n",
    "        values = sorted[col].tolist()\n",
    "        d[col] = pd.Series(names, index=list(range(1, 51)))\n",
    "        d[col+'_val'] = pd.Series(values, list(range(1, 51)))\n",
    "    df_rank = pd.DataFrame(d)\n",
    "    if to_csv:\n",
    "        df_rank.to_csv('~/scaling-science/data/magone/{}_Early_Profs_rank_2.csv'.format(name), index = False, encoding = \"UTF-8\")\n",
    "    return df_rank"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_disrupt_trim = df_disrupt.join(df_orgs, how = 'inner')\n",
    "print(\"Total: %d authors\" % df_disrupt_trim.shape[0])\n",
    "df_disrupt_trim = df_disrupt_trim[df_disrupt_trim['num_disrupt'] >= 5]\n",
    "df_disrupt_trim = df_disrupt_trim[df_disrupt_trim['orgs'] <= 2000]\n",
    "print(\"Remaining after trimming: %d authors\" % df_disrupt_trim.shape[0])\n",
    "top_100_to_csv(df_disrupt_trim, df_disrupt.columns, 'Disrupt', to_csv = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_collab_trim = df_collab.join(df_orgs, how = 'inner')\n",
    "print(\"Total: %d authors\" % df_collab_trim.shape[0])\n",
    "df_collab_trim = df_collab_trim[df_collab_trim['orgs'] <= 2000]\n",
    "print(\"Remaining after trimming: %d authors\" % df_collab_trim.shape[0])\n",
    "top_100_to_csv(df_collab_trim, df_collab.columns, 'Collab', to_csv = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_AR_trim = df_AR.join(df_orgs, how = 'inner')\n",
    "print(\"Total: %d authors\" % df_AR_trim.shape[0])\n",
    "df_AR_trim = df_AR_trim[df_AR_trim['orgs'] <= 2000]\n",
    "print(\"Remaining after trimming: %d authors\" % df_AR_trim.shape[0])\n",
    "top_100_to_csv(df_AR_trim, df_AR.columns, 'AR', to_csv = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_PR_trim = df_PR.join(df_orgs, how = 'inner')\n",
    "print(\"Total: %d authors\" % df_PR_trim.shape[0])\n",
    "df_PR_trim = df_PR_trim[df_PR_trim['orgs'] <= 2000]\n",
    "print(\"Remaining after trimming: %d authors\" % df_PR_trim.shape[0])\n",
    "top_100_to_csv(df_PR_trim, df_PR.columns, 'PR', to_csv = True)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
