{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship\n",
    "import glob, os, time\n",
    "import logging\n",
    "\n",
    "logger = logging.getLogger()\n",
    "logger.setLevel(logging.DEBUG)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Connect to graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "DEBUG:neo4j.bolt:~~ [RESOLVE] Address(host='54.174.175.98', port=7687)\n",
      "DEBUG:neo4j.bolt:~~ [RESOLVED] Address(host='54.174.175.98', port=7687) -> ('54.174.175.98', 7687)\n",
      "DEBUG:neo4j.bolt:~~ [CONNECT] ('54.174.175.98', 7687)\n",
      "DEBUG:neo4j.bolt:C: [HANDSHAKE] 0x6060B017 [2, 1, 0, 0]\n",
      "DEBUG:neo4j.bolt:S: [HANDSHAKE] 2\n",
      "DEBUG:neo4j.bolt:C: INIT ('py2neo/4.1.0 neo4j-python/1.6.3 Python/3.6.7-final-0 (linux)', {...})\n",
      "DEBUG:neo4j.bolt:S: SUCCESS ({'server': 'Neo4j/3.5.7'})\n",
      "DEBUG:neo4j.bolt:~~ [CLOSE]\n",
      "DEBUG:neo4j.bolt:C: RUN (\"CALL dbms.queryJmx('')\", {})\n",
      "DEBUG:neo4j.bolt:C: PULL_ALL ()\n",
      "DEBUG:neo4j.bolt:S: SUCCESS ({'result_available_after': 27, 'fields': ['name', 'description', 'attributes']})\n",
      "DEBUG:neo4j.bolt:S: RECORD * 2\n",
      "DEBUG:neo4j.bolt:S: RECORD * 2\n",
      "DEBUG:neo4j.bolt:S: RECORD * 7\n",
      "DEBUG:neo4j.bolt:S: RECORD * 8\n",
      "DEBUG:neo4j.bolt:S: RECORD * 2\n",
      "DEBUG:neo4j.bolt:S: RECORD * 1\n",
      "DEBUG:neo4j.bolt:S: RECORD * 6\n",
      "DEBUG:neo4j.bolt:S: SUCCESS ({'result_consumed_after': 1, 'type': 'r'})\n",
      "DEBUG:neo4j.bolt:C: RUN ('', {})\n",
      "DEBUG:neo4j.bolt:C: PULL_ALL ()\n",
      "DEBUG:neo4j.bolt:S: SUCCESS ({'result_available_after': 17, 'fields': ['name', 'description', 'attributes']})\n",
      "DEBUG:neo4j.bolt:S: RECORD * 2\n",
      "DEBUG:neo4j.bolt:S: RECORD * 2\n",
      "DEBUG:neo4j.bolt:S: RECORD * 7\n",
      "DEBUG:neo4j.bolt:S: RECORD * 8\n",
      "DEBUG:neo4j.bolt:S: RECORD * 2\n",
      "DEBUG:neo4j.bolt:S: RECORD * 1\n",
      "DEBUG:neo4j.bolt:S: RECORD * 6\n",
      "DEBUG:neo4j.bolt:S: SUCCESS ({'result_consumed_after': 1, 'type': 'r'})\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to graph database with 370,041,408 nodes and 14,502,760 relationships!\n"
     ]
    }
   ],
   "source": [
    "public_address = '54.174.175.98'\n",
    "graph = Graph('bolt://{}:7687'.format(public_address), auth=('neo4j','myneo'))\n",
    "\n",
    "n_nodes = graph.database.primitive_counts['NumberOfNodeIdsInUse']\n",
    "n_relationships = graph.database.primitive_counts['NumberOfRelationshipIdsInUse']\n",
    "print(\"Connected to graph database with {:,} nodes and {:,} relationships!\".format\n",
    "     (n_nodes, n_relationships))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup workspace"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Neo4j data directory set to ``.\n",
      "SciPy data directory set to `/tmp/data/`.\n",
      "\n",
      "MAG files:\n",
      "\tVenue files: 1\n",
      "\tPapers files: 11\n",
      "\tAuthors files: 13\n",
      "\tMAGv1 papers files: 167\n",
      "\n",
      "AMiner files:\n",
      "\tVenue files: 1\n",
      "\tPapers files: 15\n",
      "\tAuthors files: 20\n",
      "\tAMinerv1 papers files: 155\n",
      "['172573765', '168778273', '3880285', '103870658', '49861241', '200071133', '106963461', '139253143', '151741590', '175814247', '67393510', '2486275289', '41063453', '24207032', '177533077', '96410829', '110447773', '2298632', '203256638', '202193212', '154343897', '45757444', '162030435', '62468778', '128124174', '2004986', '199671312', '85134406', '111155417', '125754415', '127916151', '140251998', '207313999', '137905309', '168522863', '114430552', '25671836', '51309854', '155937366', '22947807', '127827428', '137773608', '5451a5c4e0cf0b02b5f3821a', '5451a5c5e0cf0b02b5f396be', '5451a5c6e0cf0b02b5f3984f', '5451a5c4e0cf0b02b5f38892', '5451a5c4e0cf0b02b5f38092', '5451a5c5e0cf0b02b5f39630', '5451a5c7e0cf0b02b5f3ac13', '5451a57ae0cf0b02b5f2dd9f', '5451a5c4e0cf0b02b5f380b3', '5451a5c4e0cf0b02b5f3935a', '5451a5c4e0cf0b02b5f3844b', '5451a5c6e0cf0b02b5f3986c', '5451a5c5e0cf0b02b5f396fe', '5451a5c4e0cf0b02b5f381da', '5451a5c4e0cf0b02b5f38910', '5451a5c4e0cf0b02b5f38093', '5451a5c9e0cf0b02b5f3bcf1', '5451a5c4e0cf0b02b5f388fa', '5451a5c6e0cf0b02b5f3977e', '5451a5c4e0cf0b02b5f38030', '5451a5c4e0cf0b02b5f39329', '5451a5c4e0cf0b02b5f38771', '5451a5c4e0cf0b02b5f37fc6', '5451a5c5e0cf0b02b5f3967a', '5451a5c4e0cf0b02b5f384ad', '5451a5c4e0cf0b02b5f39454', '5451a5c4e0cf0b02b5f38097', '5451a5c4e0cf0b02b5f3827c', '5451a5c6e0cf0b02b5f39776', '5451a5c4e0cf0b02b5f37c20', '5451a57ae0cf0b02b5f2de43', '5451a5c6e0cf0b02b5f3978e', '5451a5c4e0cf0b02b5f3886a', '5451a5c4e0cf0b02b5f37fc0', '5451a5c5e0cf0b02b5f3970e', '5451a5c5e0cf0b02b5f396c9', '5451a5c5e0cf0b02b5f3973f', '5451a5c4e0cf0b02b5f384c5', '5451a5c6e0cf0b02b5f39887', '5451a5c4e0cf0b02b5f387a9', '5451a5c4e0cf0b02b5f38091', '5451a5c4e0cf0b02b5f37dd5']\n"
     ]
    }
   ],
   "source": [
    "## In Neo4j 3.5+, the directory is automatically set to /import\n",
    "data_dir = '' \n",
    "scipy_data_dir = '/tmp/data/'\n",
    "\n",
    "print(\"Neo4j data directory set to `{}`.\".format(data_dir))\n",
    "print(\"SciPy data directory set to `{}`.\".format(scipy_data_dir))\n",
    "\n",
    "# MAG files\n",
    "mag_venues_file = data_dir + 'oagtwo/mag_venues.txt'\n",
    "\n",
    "n_mag_papers_files = len(glob.glob(scipy_data_dir + 'oagtwo/mag_papers_*.txt'))\n",
    "mag_papers_files = [data_dir + 'oagtwo/mag_papers_{}.txt'.format(i) for i in range(n_mag_papers_files)]\n",
    "\n",
    "n_mag_authors_files = len(glob.glob(scipy_data_dir + 'oagtwo/mag_authors_*.txt'))\n",
    "mag_authors_files = [data_dir + 'oagtwo/mag_authors_{}.txt'.format(i) for i in range(n_mag_authors_files)]\n",
    "\n",
    "n_magv1_papers_files = len(glob.glob(scipy_data_dir + 'oagone/mag_papers_*.txt'))\n",
    "mag_v1_papers_files = [data_dir + 'oagone/mag_papers_{}.txt'.format(i) for i in range(n_magv1_papers_files)]\n",
    "\n",
    "print(\"\\nMAG files:\")\n",
    "print(\"\\tVenue files: {}\".format(1))\n",
    "print(\"\\tPapers files: {}\".format(n_mag_papers_files))\n",
    "print(\"\\tAuthors files: {}\".format(n_mag_authors_files))\n",
    "print(\"\\tMAGv1 papers files: {}\".format(n_magv1_papers_files))\n",
    "\n",
    "# AMiner files\n",
    "aminer_venues_file = data_dir + 'oagtwo/aminer_venues.txt'\n",
    "\n",
    "n_aminer_papers_files = len(glob.glob(scipy_data_dir + 'oagtwo/aminer_papers_*.txt'))\n",
    "aminer_papers_files = [data_dir + 'oagtwo/aminer_papers_{}.txt'.format(i) for i in range(n_aminer_papers_files)]\n",
    "\n",
    "n_aminer_authors_files = len(glob.glob(scipy_data_dir + 'oagtwo/aminer_authors_*.txt'))\n",
    "aminer_authors_files = [data_dir + 'oagtwo/aminer_authors_{}.txt'.format(i) for i in range(n_aminer_authors_files)]\n",
    "\n",
    "n_aminer_v1_papers_files = len(glob.glob(scipy_data_dir + 'oagone/aminer_papers_*.txt'))\n",
    "aminer_v1_papers_files = [data_dir + 'oagone/aminer_papers_{}.txt'.format(i) for i in range(n_aminer_v1_papers_files)]\n",
    "      \n",
    "print(\"\\nAMiner files:\")\n",
    "print(\"\\tVenue files: {}\".format(1))\n",
    "print(\"\\tPapers files: {}\".format(n_aminer_papers_files))\n",
    "print(\"\\tAuthors files: {}\".format(n_aminer_authors_files))\n",
    "print(\"\\tAMinerv1 papers files: {}\".format(n_aminer_v1_papers_files))\n",
    "\n",
    "# Linking pairs\n",
    "venue_linking_pairs = 'oagtwo/venue_linking_pairs.txt'\n",
    "paper_linking_pairs = 'oagtwo/paper_linking_pairs.txt'\n",
    "author_linking_pairs = 'oagtwo/author_linking_pairs.txt'\n",
    "\n",
    "def run_query(query, graph, print_query=False, run_query=True, print_only=False):\n",
    "    if print_only: \n",
    "        print_query = True\n",
    "        run_query = False\n",
    "    start_time = time.time()\n",
    "    if print_query:\n",
    "        print(query)\n",
    "    if run_query:\n",
    "        graph.run(query)\n",
    "    end_time = time.time()\n",
    "    seconds_elapsed = end_time-start_time\n",
    "    minutes_elapsed = (end_time-start_time)/60\n",
    "    print(\"Query completed in {:.2f} seconds.\".format(seconds_elapsed))\n",
    "\n",
    "top_5 = ['Cell', 'Nature', 'Nature Biotechnology','Proceedings of the National Academy of Sciences of the United States of America','Science']\n",
    "top_10 = ['Cell', 'Nature', 'Nature Biotechnology','Proceedings of the National Academy of Sciences of the United States of America','Science', 'Journal of the American Chemical Society', 'JAMA', 'The New England Journal of Medicine', 'Nature Genetics', 'Neuron']\n",
    "top_42 = ['Angewandte Chemie','Blood','Cancer Cell','Cancer Discovery','Cancer Research','Cell','Cell Host & Microbe','Cell Metabolism','Cell Stem Cell','Chemistry & Biology','The EMBO Journal','Genes & Development','Immunity','Journal of Neurology','Journal of the American Chemical Society','JAMA','Journal of Biological Chemistry','Journal of Cell Biology','Journal of Clinical Investigation','Journal of Experimental Medicine','Journal of Medicinal Chemistry','The Lancet','Nature Cell Biology','Nature Chemical Biology','Nature Chemistry','Nature Medicine','Nature Methods','Nature','Nature Biotechnology','The New England Journal of Medicine','Neuron','Nature Genetics','Nature Immunology','Nature Neuroscience','Nature Structural & Molecular Biology','PLOS Biology','PLOS Genetics','PLOS Pathogens','Proceedings of the National Academy of Sciences of the United States of America','Science Signaling','Science Translational Medicine','Science']\n",
    "top_42_mag_ids = ['172573765','168778273','3880285','103870658','49861241','200071133','106963461','139253143','151741590','175814247','67393510','2486275289','41063453','24207032','177533077','96410829','110447773','2298632','203256638','202193212','154343897','45757444','162030435','62468778','128124174','2004986','199671312','85134406','111155417','125754415','127916151','140251998','207313999','137905309','168522863','114430552','25671836','51309854','155937366','22947807','127827428','137773608']\n",
    "top_42_aminer_ids = ['5451a5c4e0cf0b02b5f3821a','5451a5c5e0cf0b02b5f396be','5451a5c6e0cf0b02b5f3984f','5451a5c4e0cf0b02b5f38892','5451a5c4e0cf0b02b5f38092','5451a5c5e0cf0b02b5f39630','5451a5c7e0cf0b02b5f3ac13','5451a57ae0cf0b02b5f2dd9f','5451a5c4e0cf0b02b5f380b3','5451a5c4e0cf0b02b5f3935a','5451a5c4e0cf0b02b5f3844b','5451a5c6e0cf0b02b5f3986c','5451a5c5e0cf0b02b5f396fe','5451a5c4e0cf0b02b5f381da','5451a5c4e0cf0b02b5f38910','5451a5c4e0cf0b02b5f38093','5451a5c9e0cf0b02b5f3bcf1','5451a5c4e0cf0b02b5f388fa','5451a5c6e0cf0b02b5f3977e','5451a5c4e0cf0b02b5f38030','5451a5c4e0cf0b02b5f39329','5451a5c4e0cf0b02b5f38771','5451a5c4e0cf0b02b5f37fc6','5451a5c5e0cf0b02b5f3967a','5451a5c4e0cf0b02b5f384ad','5451a5c4e0cf0b02b5f39454','5451a5c4e0cf0b02b5f38097','5451a5c4e0cf0b02b5f3827c','5451a5c6e0cf0b02b5f39776','5451a5c4e0cf0b02b5f37c20','5451a57ae0cf0b02b5f2de43','5451a5c6e0cf0b02b5f3978e','5451a5c4e0cf0b02b5f3886a','5451a5c4e0cf0b02b5f37fc0','5451a5c5e0cf0b02b5f3970e','5451a5c5e0cf0b02b5f396c9','5451a5c5e0cf0b02b5f3973f','5451a5c4e0cf0b02b5f384c5','5451a5c6e0cf0b02b5f39887','5451a5c4e0cf0b02b5f387a9','5451a5c4e0cf0b02b5f38091','5451a5c4e0cf0b02b5f37dd5']\n",
    "top_42_ids = top_42_mag_ids + top_42_aminer_ids\n",
    "\n",
    "print(top_42_ids)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Import functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_constraints(print_only=False):\n",
    "    logging.info(\"Adding uniqueness constraints\")\n",
    "    contraint_pairs = [('n:Quanta', 'n.id'),  \n",
    "                       ('a:Author', 'a.id'),\n",
    "                       ('v:Venue', 'v.id'),\n",
    "                       ('t:Tag', 't.cleanName')]\n",
    "    \n",
    "    for n, p in contraint_pairs:\n",
    "        query = \"CREATE CONSTRAINT ON ({}) ASSERT {} IS UNIQUE;\".format(n,p)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "def add_indices(print_only=False):\n",
    "    logging.info(\"Adding indexes\")\n",
    "    indices = [':Quanta(cleanName)',\n",
    "               ':Quanta(idv1)',\n",
    "               ':Venue(cleanName)', \n",
    "               ':Venue(matchingId)',\n",
    "               ':Year(year)',\n",
    "               ':Author(cleanName)',\n",
    "               ':Organization(cleanName)']\n",
    "    \n",
    "    for index in indices:\n",
    "        query = \"CREATE INDEX ON {};\".format(index)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "\n",
    "## (:Year)\n",
    "def add_years(min_year, max_year, print_only=False):\n",
    "    logging.info(\"Adding (:Year)\")\n",
    "    query = \"\"\"\n",
    "    UNWIND range({}, {}) as yr\n",
    "    MERGE (y:Year {{year: yr}})\n",
    "    \"\"\".format(min_year, max_year)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "## (:Venue)\n",
    "def add_venues(venues_file, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Venue)\".format(source_label))\n",
    "    query = \"\"\" \n",
    "    CALL apoc.load.json('{venue_file}') YIELD value AS q\n",
    "    CREATE (v:Venue{source_label} {{id:q.id}})\n",
    "        SET v.journalId = q.JournalId, \n",
    "            v.conferenceId = q.ConferenceId, \n",
    "            v.matchingId = coalesce(q.JournalId, q.ConferenceId, q.id),\n",
    "            v.name = q.DisplayName, \n",
    "            v.normalizedName = q.NormalizedName,\n",
    "            v.cleanName = apoc.text.clean(q.DisplayName);\n",
    "    \"\"\".format(source_label=source_label, venue_file=venues_file)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "\n",
    "## (:Quanta)\n",
    "def add_quanta(papers_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Quanta{})\".format(source_label))\n",
    "    for file_name in papers_files:\n",
    "        print('Importing {}'.format(file_name))\n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{paper_file}') YIELD value AS q RETURN q\",\n",
    "        \"WHERE \n",
    "            (q IS NOT NULL) AND \n",
    "            (size(q.title) <= 3000) AND\n",
    "            exists(q.venue.id) AND\n",
    "            (q.venue.id IN {venue_ids})\n",
    "         MERGE (p:Quanta{source_label} {{id:q.id}})\n",
    "            SET p.title = q.title, \n",
    "                p.cleanName = apoc.text.clean(q.title),\n",
    "                p.year = q.year, \n",
    "                p.citations = q.n_citation, \n",
    "                p.docType = q.doc_type, \n",
    "                p.language = q.lang, \n",
    "                p.publisher = q.publisher, \n",
    "                p.doi = q.doi, \n",
    "                p.pdf = q.pdf, \n",
    "                p.volume = q.volume, \n",
    "                p.issue = q.issue,\n",
    "                p.abstract = q.abstract;\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:true}});\n",
    "        \"\"\".format(paper_file=file_name, source_label=source_label, venue_ids=top_42_ids)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Quanta {idv1})\")\n",
    "def add_v1_data(v1_papers_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Quanta{}) from OAGv1\".format(source_label))\n",
    "    for file_name in v1_papers_files:\n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"CALL apoc.load.json('{papers_file}') YIELD value AS q RETURN q\",\n",
    "            \"MATCH (p:Quanta{source_label})\n",
    "             WHERE (p.cleanName = apoc.text.clean(q.title))\n",
    "                 AND ((p.doi = q.doi) OR ((p.volume = q.volume) AND (p.issue = q.issue)))\n",
    "             SET p.idv1 = q.id, p.abstract=q.abstract\",\n",
    "            {{batchSize:10000, iterateList:true, parallel:false}});\n",
    "        \"\"\".format(source_label=source_label, papers_file=file_name)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "def merge_quanta_on_cleanname(source_label='', print_only=False):\n",
    "    logging.info(\"Merging (q:Quanta{}) on q.cleanName\".format(source_label))\n",
    "    \n",
    "    # First match in fine-grained way\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\n",
    "        \"MATCH (q:Quanta{source_label}) \n",
    "         WHERE EXISTS(q.cleanName)\n",
    "         WITH \n",
    "             q.cleanName as cleanName, \n",
    "             q.year as year, \n",
    "             q.publisher as publisher, \n",
    "             q.doi as doi,\n",
    "             q.volume as volume,\n",
    "             q.issue as issue,\n",
    "             COLLECT(q) as nodeList, \n",
    "             COUNT(q) as count\n",
    "         WHERE count>=2\n",
    "         RETURN nodeList\",\n",
    "        \"CALL apoc.refactor.mergeNodes(nodeList, \n",
    "         {{properties:'discard', mergeRels:true}})\n",
    "         YIELD node\n",
    "         RETURN 'none'\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:true}});\n",
    "    \"\"\".format(source_label=source_label)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "    # Now match in course-grained way\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\n",
    "        \"MATCH (q:Quanta{source_label}) \n",
    "         WHERE EXISTS(q.cleanName)\n",
    "         WITH \n",
    "             q.cleanName as cleanName, \n",
    "             COLLECT(q) as nodeList, \n",
    "             COUNT(q) as count\n",
    "         WHERE count>=2\n",
    "         RETURN nodeList\",\n",
    "        \"CALL apoc.refactor.mergeNodes(nodeList, \n",
    "         {{properties:'discard', mergeRels:true}})\n",
    "         YIELD node\n",
    "         RETURN 'none'\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:true}});\n",
    "    \"\"\".format(source_label=source_label)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "## (:Quanta)-[:PUBLISHED_IN]->(:Year)\n",
    "def add_quanta_year_edges(papers_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (q:Quanta{})-[:PUBLISHED_IN]->(:Year)\".format(source_label))\n",
    "    for file_name in papers_files:\n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{file}') YIELD value AS q RETURN q\",\n",
    "        \"WHERE \n",
    "            (q IS NOT NULL) AND \n",
    "            (size(q.title) <= 3000) AND\n",
    "            exists(q.venue.id) AND\n",
    "            (q.venue.id IN {venues})\n",
    "         MATCH (p:Quanta{source} {{id:q.id}})\n",
    "         MATCH (y:Year {{year: q.year}})\n",
    "         CREATE (p)-[:PUBLISHED_IN]->(y)\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:false}})\n",
    "        \"\"\".format(file=file_name, venues=top_42_ids, source=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Quanta)-[:PUBLISHED_IN]->(:Venue)\n",
    "def add_quanta_venue_edges(papers_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (q:Quanta{})-[:PUBLISHED_IN]->(:Venue)\".format(source_label))\n",
    "    for file_name in papers_files:\n",
    "\n",
    "        # First run on all venues WITH id's \n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{file}') \n",
    "         YIELD value AS q \n",
    "         RETURN q\",\n",
    "        \"WHERE \n",
    "            (q IS NOT NULL) AND \n",
    "            (size(q.title) <= 3000) AND\n",
    "            exists(q.venue.id) AND\n",
    "            (q.venue.id IN {venues})\n",
    "         MATCH (p:Quanta{source} {{id:q.id}} )\n",
    "         MATCH (v:Venue {{matchingId:q.venue.id}} )\n",
    "         CREATE (p)-[:PUBLISHED_IN]->(v)\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:false}})        \n",
    "        \"\"\".format(file=file_name, venues=top_42_ids, source=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "        # Second, run on all venues WITHOUT id's\n",
    "        # This means that the :Venue is not in the graph\n",
    "        # So we want to MERGE it in\n",
    "#         query = \"\"\"\n",
    "#         CALL apoc.periodic.iterate(\n",
    "#         \"CALL apoc.load.json('{}') \n",
    "#          YIELD value AS q \n",
    "#          RETURN q\",\n",
    "#         \"WHERE not(exists(q.venue.id)) AND exists(q.venue.raw) \n",
    "#          MATCH (p:Quanta {{id:q.id}} )\n",
    "#          MERGE (v:Venue {{cleanName:apoc.text.clean(q.venue.raw)}} )\n",
    "#          CREATE (p)-[:PUBLISHED_IN]->(v)\",\n",
    "#         {{batchSize:5000, iterateList:true, parallel:false}})        \n",
    "#         \"\"\".format(file_name)            \n",
    "#         run_query(query, graph, print_only=print_only)\n",
    "\n",
    "## (:Author)\n",
    "def add_authors(authors_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Author{})\".format(source_label))\n",
    "    for file_name in authors_files: \n",
    "        print('Importing {}'.format(file_name))\n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{file}') YIELD value AS q RETURN q\",\n",
    "        \"MERGE (a:Author{source} {{id:q.id}})\n",
    "        SET a.name = q.name, \n",
    "            a.normalizedName = q.normalized_name, \n",
    "            a.cleanName = apoc.text.clean(q.normalized_name),\n",
    "            a.position = q.position, \n",
    "            a.lastAffiliation = q.org,\n",
    "            a.citations = q.n_citation, \n",
    "            a.numPublications = q.n_pubs, \n",
    "            a.hIndex=q.h_index\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:true}});\n",
    "        \"\"\".format(file=file_name, source=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Author)-[:AUTHORED]->(:Quanta)\n",
    "def add_author_quanta_edges(authors_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Author{s})-[:AUTHORED]->(:Quanta{s})\".format(s=source_label))\n",
    "    for file_name in authors_files: \n",
    "        print('Creating authored relationships for {}'.format(file_name))\n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{file}') YIELD value AS q RETURN q\",\n",
    "        \"MATCH (a:Author{source} {{id:q.id}})\n",
    "        UNWIND q.pubs as pub\n",
    "        MATCH (p:Quanta{source} {{id:pub.i}})\n",
    "        MERGE (a)-[r:AUTHORED]->(p)\n",
    "        ON CREATE SET r.order = CASE WHEN pub.r IS NULL THEN NULL ELSE pub.r END\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:false}});\n",
    "        \"\"\".format(file=file_name, source=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Organization)\n",
    "def add_organizations(authors_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Organization{s})\".format(s=source_label))\n",
    "    for file_name in authors_files: \n",
    "        query = \"\"\"\n",
    "        call apoc.periodic.commit(\"\n",
    "        CALL apoc.load.json('{file}') \n",
    "        YIELD value AS q\n",
    "        WITH q \n",
    "        LIMIT {{limit}}\n",
    "        WHERE EXISTS(q.org)\n",
    "        MATCH (:Author{s} {{id:q.id}})\n",
    "        MERGE (o:Organization{s} {{cleanName: apoc.text.clean(q.org)}})\n",
    "        ON CREATE SET o.name = q.org\n",
    "        \", {{limit:50000}});\n",
    "        \"\"\".format(file=file_name, s=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Author)-[:AFFILIATED]->(:Organization)\n",
    "def add_author_organization_edges(authors_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Author{s})-[:AFFILIATED]->(:Organization{s})\".format(s=source_label))\n",
    "    for file_name in authors_files: \n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"CALL apoc.load.json('{file}') \n",
    "             YIELD value AS q \n",
    "             RETURN q\",\n",
    "            \"WHERE q.org IS NOT NULL\n",
    "             MATCH (a:Author{s} {{id: q.id}})\n",
    "             MATCH (o:Organization{s} {{cleanName: apoc.text.clean(q.org)}})\n",
    "             MERGE (a)-[:AFFILIATED]->(o);\",\n",
    "            {{batchSize:5000, iterateList:true, parallel:false}});\n",
    "        \"\"\".format(file=file_name, s=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Quanta)-[:CITES]->(:Quanta)\n",
    "def add_quanta_quanta_edges(v1_papers_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Quanta{s})-[:CITES]->(:Quanta{s})\".format(s=source_label))\n",
    "    for file_name in v1_papers_files:\n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\"\n",
    "            CALL apoc.load.json('{f}') \n",
    "            YIELD value AS q\n",
    "            RETURN q\n",
    "            \",\"\n",
    "            MATCH (p:Quanta{s} {{idv1: q.id}})\n",
    "            UNWIND q.references as ref\n",
    "            WITH p, ref\n",
    "            MATCH (b:Quanta{s} {{idv1: ref}})\n",
    "            MERGE (p)-[:CITES]->(b)\n",
    "            \",{{batchSize:10000, iterateList:true, parallel:false}});\n",
    "        \"\"\".format(f=file_name, s=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Author)-[:COAUTHOR]-(:Author)\n",
    "def add_author_author_edges(source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Author)-[:COAUTHOR]-(:Author)\".format(s=source_label))\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\n",
    "        \"MATCH (q:Quanta{s}) WHERE size((q)<-[:AUTHORED]-()) > 1 RETURN q\",\n",
    "        \"WITH [(q)<-[:AUTHORED]-(a) | a] as coAuthors\n",
    "        UNWIND coAuthors as first\n",
    "        UNWIND coAuthors as second\n",
    "        WITH first, second\n",
    "        WHERE id(first) < id(second)\n",
    "        MERGE (first)-[r:COAUTHOR]-(second)\n",
    "        SET r.strength = CASE WHEN r.strength IS NULL THEN 1 ELSE r.strength + 1 END\",\n",
    "    {{batchSize:5000, iterateList:true, parallel:false}});\n",
    "    \"\"\".format(s=source_label)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "    \n",
    "## (:Tag)\n",
    "def add_tags(authors_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Tag{s})\".format(s=source_label))\n",
    "    for file_name in authors_files: \n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"CALL apoc.load.json('{f}') \n",
    "             YIELD value AS q \n",
    "             RETURN q\",\n",
    "            \"WITH q \n",
    "             WHERE exists(q.tags)\n",
    "             MATCH (a:Author{s} {{id: q.id}})\n",
    "             UNWIND q.tags as tag\n",
    "             MERGE (t:Tag{s} {{cleanName: apoc.text.clean(tag.t)}})\n",
    "             ON CREATE SET t.name = tag.t\",\n",
    "            {{batchSize:5000, iterateList:true, parallel:true}})\n",
    "        \"\"\".format(f=file_name, s=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Author)-[:HAS_TAG]->(:Tag)\n",
    "def add_author_tag_edges(authors_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Author{s})-[:HAS_TAG]->(:Tag)\".format(s=source_label))\n",
    "    for file_name in authors_files: \n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{file}') \n",
    "         YIELD value AS q \n",
    "         RETURN q\",\n",
    "        \"WITH q\n",
    "         WHERE q.tags IS NOT NULL \n",
    "         MATCH (a:Author{source} {{id:q.id}})\n",
    "         UNWIND q.tags as tag\n",
    "         MATCH (t:Tag {{cleanName:apoc.text.clean(tag.t)}})\n",
    "         MERGE (a)-[:HAS_TAG]->(t)\",\n",
    "        {{batchSize:10000, iterateList:true, parallel:false}});\n",
    "        \"\"\".format(file=file_name, source=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "        \n",
    "## (:Quanta {idv1})-[:HAS_TAG]->(:Tag)\n",
    "def add_mag_quanta_tag_edges(papers_v1_files, source_label='', print_only=False):\n",
    "    logging.info(\"Adding (:Quanta{s})-[:HAS_TAG]->(:Tag)\".format(s=source_label))\n",
    "    for file_name in authors_files: \n",
    "        query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        \"CALL apoc.load.json('{file}') \n",
    "         YIELD value AS q \n",
    "         RETURN q\",\n",
    "        \"WITH q\n",
    "         WHERE q.keywords IS NOT NULL \n",
    "         MATCH (q:Quanta{source} {{id:q.idv1}})\n",
    "         UNWIND q.keywords as tag\n",
    "         MERGE (t:Tag {{cleanName:apoc.text.clean(tag.t)}})\n",
    "         MERGE (q)-[:HAS_TAG]->(t)\",\n",
    "        {{batchSize:5000, iterateList:true, parallel:false}});\n",
    "        \"\"\".format(file=file_name, source=source_label)\n",
    "        run_query(query, graph, print_only=print_only)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Other updates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cull_isolated_authors(source_label='', print_only=False):\n",
    "    logging.info(\"Removing (a:Author{s}) WHERE not((a)-[:AUTHORED]->())\".format(s=source_label))\n",
    "    query = \"\"\"\n",
    "    call apoc.periodic.commit(\"\n",
    "    MATCH (a:Author{s}) WHERE NOT ((a)-[:AUTHORED]->())\n",
    "    WITH a LIMIT {{limit}}\n",
    "    DETACH DELETE a\n",
    "    RETURN count(*)\n",
    "    \", {{limit:50000}});\n",
    "    \"\"\".format(s=source_label)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "\n",
    "def cull_isolated_quanta(source_label='', print_only=False):\n",
    "    logging.info(\"Removing (a:Quanta{s}) WHERE not((a)-[:CITES]-())\".format(s=source_label))\n",
    "    query = \"\"\"\n",
    "    call apoc.periodic.commit(\"\n",
    "    MATCH (a:Quanta{s}) WHERE NOT ((a)-[:CITES]-())\n",
    "    WITH a LIMIT {{limit}}\n",
    "    DETACH DELETE a\n",
    "    RETURN count(*)\n",
    "    \", {{limit:50000}});\n",
    "    \"\"\".format(s=source_label)\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "def merge_mag_aminer_venues(print_only=False):\n",
    "    logging.info(\"Merging (:Venue:Mag) and (:Venue:Aminer)\")\n",
    "    query = \"\"\"\n",
    "    CALL apoc.load.json('oagtwo/venue_linking_pairs.txt') \n",
    "    YIELD value as q\n",
    "    MATCH (m:Venue:Mag {id:q.mid})\n",
    "    MATCH (a:Venue:Aminer {id:q.aid})\n",
    "    SET m.idAminer = q.aid\n",
    "    SET m.idMag = q.mid\n",
    "    SET m:Aminer:Mag\n",
    "    WITH [m, a] as ns\n",
    "    CALL apoc.refactor.mergeNodes(ns, \n",
    "         {properties:'discard', mergeRels:true}) \n",
    "    YIELD node RETURN 'none'\n",
    "    \"\"\" \n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "def merge_mag_aminer_authors(print_only=False):\n",
    "    logging.info(\"Merging (:Author:Mag) and (:Author:Aminer)\")\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\n",
    "    \"CALL apoc.load.json('oagtwo/author_linking_pairs.txt') \n",
    "     YIELD value as q RETURN q\",\n",
    "    \"MATCH (m:Author:Mag {id:q.mid})\n",
    "     MATCH (a:Author:Aminer {id:q.aid})\n",
    "     SET m.idAminer = q.aid\n",
    "     SET m.idMag = q.mid\n",
    "     SET m:Aminer:Mag\n",
    "     WITH [m, a] as ns\n",
    "     CALL apoc.refactor.mergeNodes(ns, \n",
    "          {properties:'discard', mergeRels:true}) \n",
    "     YIELD node RETURN 'none';\",\n",
    "     {batchSize:10000, iterateList:true, parallel:false});\n",
    "    \"\"\"\n",
    "    run_query(query, graph, print_only=print_only)\n",
    "    \n",
    "def merge_mag_aminer_papers(print_only=False):\n",
    "    logging.info(\"Merging (:Quanta:Mag) and (:Quanta:Aminer)\")\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\n",
    "    \"CALL apoc.load.json('oagtwo/paper_linking_pairs.txt') \n",
    "     YIELD value as q RETURN q\",\n",
    "    \"MATCH (m:Quanta:Mag {id:q.mid})\n",
    "     MATCH (a:Quanta:Aminer {id:q.aid})\n",
    "     SET m.idAminer = q.aid\n",
    "     SET m.idMag = q.mid\n",
    "     SET m:Aminer:Mag\n",
    "     WITH [m, a] as ns\n",
    "     CALL apoc.refactor.mergeNodes(ns, \n",
    "          {properties:'discard', mergeRels:true}) \n",
    "     YIELD node RETURN 'none';\",\n",
    "     {batchSize:10000, iterateList:true, parallel:false});\n",
    "    \"\"\"\n",
    "    run_query(query, graph, print_only=print_only)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Run Import"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:root:Adding (:Quanta:Mag)-[:CITES]->(:Quanta:Mag)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_0.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_1.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_2.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_3.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_4.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_5.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_6.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_7.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_8.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_9.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_10.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_11.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_12.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_13.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_14.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_15.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_16.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_17.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_18.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_19.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_20.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_21.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_22.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_23.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_24.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_25.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_26.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_27.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_28.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_29.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_30.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_31.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_32.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_33.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_34.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_35.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_36.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_37.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_38.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_39.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_40.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_41.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_42.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_43.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_44.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_45.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_46.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_47.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_48.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_49.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_50.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_51.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_52.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_53.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_54.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_55.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_56.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_57.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_58.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_59.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_60.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_61.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_62.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_63.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_64.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_65.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_66.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_67.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_68.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_69.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_70.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_71.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_72.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_73.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_74.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_75.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_76.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_77.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_78.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_79.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_80.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_81.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_82.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_83.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_84.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_85.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_86.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_87.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_88.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_89.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_90.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_91.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_92.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_93.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_94.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_95.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_96.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_97.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_98.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_99.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_100.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_101.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_102.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_103.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_104.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_105.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_106.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_107.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_108.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_109.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_110.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_111.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_112.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_113.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_114.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_115.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_116.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_117.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_118.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_119.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_120.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_121.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_122.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_123.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_124.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_125.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_126.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_127.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_128.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_129.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_130.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_131.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_132.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_133.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_134.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_135.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_136.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_137.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_138.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_139.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_140.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_141.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_142.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_143.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_144.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_145.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_146.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_147.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_148.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_149.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_150.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_151.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_152.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_153.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_154.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_155.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_156.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_157.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_158.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_159.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_160.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_161.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_162.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_163.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_164.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_165.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n",
      "\n",
      "        CALL apoc.periodic.commit(\"\n",
      "            CALL apoc.load.json('oagone/mag_papers_166.txt') \n",
      "            YIELD value AS q\n",
      "            WITH q LIMIT {limit}\",\n",
      "            MATCH (p:Quanta:Mag {idv1: q.id})\n",
      "            UNWIND q.references as ref\n",
      "            WITH p, ref\n",
      "            MATCH (b:Quanta:Mag {idv1: ref})\n",
      "            MERGE (p)-[:CITES]->(b)\n",
      "            \",{limit:10000});\n",
      "        \n",
      "Query completed in 0.00 seconds.\n"
     ]
    }
   ],
   "source": [
    "add_quanta_quanta_edges(mag_v1_papers_files, source_label=\":Mag\", print_only=True)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_constraints(print_only=False)\n",
    "add_indices(print_only=False)\n",
    "add_years(1700, 2020)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import MAG"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "mag_label = ':Mag'\n",
    "aminer_label = ':Aminer'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:root:Merging (q:Quanta:Mag) on q.cleanName\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    CALL apoc.periodic.iterate(\n",
      "        \"MATCH (q:Quanta:Mag) \n",
      "         WHERE EXISTS(q.cleanName)\n",
      "         WITH \n",
      "             q.cleanName as cleanName, \n",
      "             q.year as year, \n",
      "             q.citations as citations,\n",
      "             q.publisher as publisher, \n",
      "             COLLECT(q) as nodeList, \n",
      "             count(*) as count\n",
      "         WHERE count>=2\n",
      "         RETURN nodeList\",\n",
      "        \"CALL apoc.refactor.mergeNodes(nodeList, \n",
      "         {properties:'discard', mergeRels:true})\n",
      "         YIELD node\n",
      "         RETURN 'none'\",\n",
      "        {batchSize:10000, iterateList:true, parallel:false});\n",
      "    \n",
      "Query completed in 0.00 seconds.\n"
     ]
    }
   ],
   "source": [
    "add_venues(mag_venues_file, source_label=mag_label)\n",
    "add_quanta(mag_papers_files, source_label=mag_label, print_only=True)\n",
    "add_v1_data(mag_v1_papers_files, source_label=mag_label, print_only=True)\n",
    "add_authors(mag_authors_files, source_label=mag_label, print_only=True)\n",
    "add_author_quanta_edges(mag_authors_files, source_label=mag_label, print_only=False)\n",
    "cull_isolated_authors(source_label=mag_label)\n",
    "add_organizations(mag_authors_files, source_label=mag_label, print_only=True)\n",
    "merge_quanta_on_cleanname(source_label=mag_label, print_only=True)\n",
    "add_quanta_year_edges(mag_papers_files, source_label=mag_label, print_only=False)\n",
    "add_quanta_venue_edges(mag_papers_files, source_label=mag_label, print_only=False)\n",
    "add_author_organization_edges(mag_authors_files, source_label=mag_label)\n",
    "add_quanta_quanta_edges(mag_v1_papers_files, source_label=mag_label)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_tags(mag_authors_files, source_label=mag_label)\n",
    "add_author_tag_edges(mag_authors_files, source_label=mag_label)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import AMiner"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_venues(aminer_venues_file, source_label=aminer_label)\n",
    "add_quanta(aminer_papers_files, source_label=aminer_label)\n",
    "add_authors(aminer_authors_files, source_label=aminer_label)\n",
    "add_author_quanta_edges(aminer_authors_files, source_label=aminer_label)\n",
    "cull_isolated_authors(source_label=aminer_label)\n",
    "add_organizations(aminer_authors_files, source_label=aminer_label)\n",
    "add_quanta_year_edges(aminer_papers_files, source_label=aminer_label)\n",
    "add_quanta_venue_edges(aminer_papers_files, source_label=aminer_label)\n",
    "add_author_organization_edges(aminer_authors_files, source_label=aminer_label)\n",
    "merge_quanta_on_cleanname(source_label=aminer_label, print_only=False)\n",
    "add_v1_data(aminer_v1_papers_files, source_label=aminer_label)\n",
    "add_quanta_quanta_edges(aminer_v1_papers_files, source_label=aminer_label)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_tags(aminer_authors_files, source_label=aminer_label)\n",
    "add_author_tag_edges(aminer_authors_files, source_label=aminer_label)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Further additions and modifications"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_author_author_edges()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "merge_mag_aminer_venues(venue_linking_pairs)\n",
    "merge_mag_aminer_papers(paper_linking_pairs)\n",
    "merge_mag_aminer_authors(author_linking_pairs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# MErge duplicate venues, organizations, authors?"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
