{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [],
   "source": [
    "data_files = glob.glob('/tmp/data/patents/*.h5')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading /tmp/data/patents/res_1_2mil.h5... Writing /tmp/data/patents/res_1_2mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_4_5mil.h5... Writing /tmp/data/patents/res_4_5mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_0_1mil.h5... Writing /tmp/data/patents/res_0_1mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_2_3mil.h5... Writing /tmp/data/patents/res_2_3mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_7_8mil.h5... Writing /tmp/data/patents/res_7_8mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_5_6mil.h5... Writing /tmp/data/patents/res_5_6mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_8_9mil.h5... Writing /tmp/data/patents/res_8_9mil.csv... Done.\n",
      "Reading /tmp/data/patents/res_3_4mil.h5... "
     ]
    }
   ],
   "source": [
    "import numpy as np\n",
    "import pandas as pd\n",
    "import glob\n",
    "import csv\n",
    "\n",
    "data_files = glob.glob('/tmp/data/patents/*.h5')\n",
    "for file in data_files:\n",
    "    \n",
    "    print(\"Reading {}...\".format(file), end=\" \")\n",
    "    df = pd.read_hdf(file)\n",
    "    df.columns = ['title','inventors','pub_date','classifications','n_citations',\n",
    "                  'cited_by', 'patent_citations','also_published_as','location']\n",
    "    df['title'] = df['title'].str.strip()\n",
    "    df['classifications'] = df['classifications'].str.join(\";\")\n",
    "    df['inventors'] = df['inventors'].str.join(\";\")\n",
    "    df['cited_by'] = df['cited_by'].str.join(\";\")\n",
    "    df['patent_citations'] = df['patent_citations'].str.join(\";\")\n",
    "    df['also_published_as'] = df['also_published_as'].str.join(\";\")\n",
    "#     df.replace(\"\", np.nan, inplace=True)\n",
    "    assert(not df.index.duplicated().any())\n",
    "    \n",
    "    new_file = file.replace('.h5','.csv')\n",
    "    print(\"Writing {}...\".format(new_file), end=\" \")\n",
    "    df.to_csv(path_or_buf=new_file, sep=',', quoting=csv.QUOTE_MINIMAL, chunksize=50000, index_label='number', na_rep='na')\n",
    "    print(\"Done.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Need to do something with the ALSO published as\n",
    "# sum(df['also_published_as'].str.len())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from py2neo import Graph\n",
    "from py2neo.data import Node, Relationship\n",
    "\n",
    "# Need to get authentication working, currently NEO4J_AUTH=none\n",
    "graph = Graph(\"bolt://neo4j:7687\")\n",
    "\n",
    "graph.delete_all()\n",
    "\n",
    "n_nodes = graph.database.primitive_counts['NumberOfNodeIdsInUse']\n",
    "n_relationships = graph.database.primitive_counts['NumberOfRelationshipIdsInUse']\n",
    "print(\"Connected to graph database with {:,} nodes and {:,} relationships!\".format\n",
    "     (n_nodes, n_relationships))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Creating uniqueness constraint for number... Done.\n",
      "Creating index for classifications... Done.\n",
      "Creating index for classifications... Done.\n",
      "Creating index for inventors... Done.\n",
      "Creating index for location... Done.\n",
      "Creating index for pub_date... Done.\n"
     ]
    }
   ],
   "source": [
    "# # Constrain one id per Patent\n",
    "# print(\"Creating uniqueness constraint (and also index) on Patent numbers...\", end=\" \", flush=True)\n",
    "# query = \"\"\"CREATE CONSTRAINT ON (n:Patent) ASSERT n.number IS UNIQUE;\"\"\"\n",
    "# graph.run(query).evaluate()\n",
    "# print(\"Done.\")\n",
    "\n",
    "# Add index for number\n",
    "print(\"Creating uniqueness constraint for number...\", end=\" \", flush=True)\n",
    "query = \"\"\"CREATE CONSTRAINT ON (n:Patent) ASSERT n.number IS UNIQUE;\"\"\"\n",
    "graph.run(query).evaluate()\n",
    "print(\"Done.\")\n",
    "\n",
    "# Add index for classifications\n",
    "print(\"Creating index for classifications...\", end=\" \", flush=True)\n",
    "query = \"\"\"CREATE INDEX ON :Patent(classifications);\"\"\"\n",
    "graph.run(query).evaluate()\n",
    "print(\"Done.\")\n",
    "\n",
    "# Add index for classifications\n",
    "print(\"Creating index for classifications...\", end=\" \", flush=True)\n",
    "query = \"\"\"CREATE INDEX ON :Patent(classifications);\"\"\"\n",
    "graph.run(query).evaluate()\n",
    "print(\"Done.\")\n",
    "\n",
    "# Add index for inventors\n",
    "print(\"Creating index for inventors...\", end=\" \", flush=True)\n",
    "query = \"\"\"CREATE INDEX ON :Patent(inventors);\"\"\"\n",
    "graph.run(query).evaluate()\n",
    "print(\"Done.\")\n",
    "\n",
    "# Add index for location\n",
    "print(\"Creating index for location...\", end=\" \", flush=True)\n",
    "query = \"\"\"CREATE INDEX ON :Patent(location);\"\"\"\n",
    "graph.run(query).evaluate()\n",
    "print(\"Done.\")\n",
    "\n",
    "# Add index for pub_date\n",
    "print(\"Creating index for pub_date...\", end=\" \", flush=True)\n",
    "query = \"\"\"CREATE INDEX ON :Patent(pub_date);\"\"\"\n",
    "graph.run(query).evaluate()\n",
    "print(\"Done.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Importing /tmp/data/patents/res_5_6mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_5_6mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_7_8mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_7_8mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_1_2mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_1_2mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_8_9mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_8_9mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_0_1mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_0_1mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_3_4mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_3_4mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_2_3mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_2_3mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/patents.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/patents.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_6_7mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_6_7mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_9_10mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_9_10mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n",
      "Importing /tmp/data/patents/res_4_5mil.csv... \n",
      "    CALL apoc.periodic.iterate(\"\n",
      "    CALL apoc.load.csv('file:///tmp/data/patents/res_4_5mil.csv',\n",
      "        {header:true,sep:',',\n",
      "        mapping:{\n",
      "            patent_citations:{array:true,nullValues:['na']},\n",
      "            also_published_as:{array:true,nullValues:['na']},\n",
      "            cited_by:{array:true,nullValues:['na']},\n",
      "            inventors:{array:true,nullValues:['na']},\n",
      "            n_citations:{type:'int',nullValues:['na']},\n",
      "            classifications:{array:true,nullValues:['na']},\n",
      "            location:{nullValues:['na']}}\n",
      "        })\n",
      "    YIELD map as row RETURN row\n",
      "    \",\"\n",
      "    CREATE (p:Patent) SET p = row\n",
      "    \", {batchsize:50000, iterateList:true, parallel:true});\n",
      "    \n",
      "Done.\n"
     ]
    }
   ],
   "source": [
    "# Import patents\n",
    "\n",
    "data_files = glob.glob('/tmp/data/patents/*.csv')\n",
    "for file in data_files:\n",
    "    print(\"Importing {}...\".format(file), end=\" \", flush=True)\n",
    "    query = \"\"\"\n",
    "    CALL apoc.periodic.iterate(\"\n",
    "    CALL apoc.load.csv('file://{}',\n",
    "        {{header:true,sep:',',\n",
    "        mapping:{{\n",
    "            patent_citations:{{array:true,nullValues:['na']}},\n",
    "            also_published_as:{{array:true,nullValues:['na']}},\n",
    "            cited_by:{{array:true,nullValues:['na']}},\n",
    "            inventors:{{array:true,nullValues:['na']}},\n",
    "            n_citations:{{type:'int',nullValues:['na']}},\n",
    "            classifications:{{array:true,nullValues:['na']}},\n",
    "            location:{{nullValues:['na']}}}}\n",
    "        }})\n",
    "    YIELD map as row RETURN row\n",
    "    \",\"\n",
    "    CREATE (p:Patent) SET p = row\n",
    "    \", {{batchsize:50000, iterateList:true, parallel:true}});\n",
    "    \"\"\".format(file)\n",
    "    print(query)\n",
    "    # graph.run(query).evaluate()\n",
    "    print(\"Done.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding citation relationships... \n",
      "CALL apoc.periodic.iterate(\n",
      "\"MATCH (a:Patent) UNWIND a.cited_by AS ref RETURN a, ref\",\n",
      "\"MATCH (b:Patent {number: ref}) MERGE (b)-[:CITES]->(a)\",\n",
      "{batchSize:100, iterateList:true, parallel:false})\n",
      "\n",
      "Done.\n"
     ]
    }
   ],
   "source": [
    "print(\"Adding citation relationships...\", end=\" \", flush=True)\n",
    "query = \"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "\"MATCH (a:Patent) UNWIND a.cited_by AS ref RETURN a, ref\",\n",
    "\"MATCH (b:Patent {number: ref}) MERGE (b)-[:CITES]->(a)\",\n",
    "{batchSize:100, iterateList:true, parallel:false})\n",
    "\"\"\"\n",
    "print(query)\n",
    "# graph.run(query).evaluate()\n",
    "print(\"Done.\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
